{
  "clusters": [
    {
      "cluster_id": 0,
      "article_count": 2,
      "sentences_kept": 88,
      "text": "Who are BJP's dozen who lost despite party's 88% strike rate in Bihar?\nSometimes a few votes make all the difference.\nThe BJP, which won 89 seats out of the 101 it contested in Bihar Assembly polls, lost three seats by slender margins of 30, 178, and 221 votes.\nThe BJP emerged victorious on 89 of the 101 seats it contested to become the single largest party in Bihar's 243-member Assembly.\nThe party's strike rate in the Bihar Assembly election was an impressive 88%.\nIn four of these 12 seats, the margin of defeat for the BJP was less than a thousand votes.\nTen seats had a margin of less than 10,000 votes.\nDespite a wave, who are the dozen who didn't manage to cross the finish line, and by what distance did they fall short?\nThree of the most nail-biting contests saw the BJP lose by just 30 votes in Ramgarh to the BSP, 178 votes in Dhaka to the RJD, and 221 votes in Seemanchal's Forbesganj to the Congress.\nOf these 12 BJP losses, four came from Seemanchal, translating to gains for the Congress and the AIMIM in this minority-heavy belt.\nTwo defeats for the BJP came from the Mithila-Koshi region, where the RJD and smaller parties consolidated their base.\nThe remaining six defeats were scattered, among seats in Saran, Champaran, Magadh, and Tirhut divisions.\nHere is a break-down of the 12 BJP losses, and what regional story they narrate.\n4 OF 12 BJP DEFEATS CAME FROM BIHAR'S SEEMANCHAL\nIn the Seemanchal region, where the Asaduddin Owaisi-led AIMIM won five seats, the BJP candidates faced defeats in four seats.\nIn Araria district's Forbesganj, the BJP's Vidya Sagar Keshri lost to the Congress' Manoj Bishwas by just 221 votes.\nIn the Kishanganj seat, the Congress' Qamrul Hoda defeated the BJP's Sweety Kumari by 12,794 votes.\nIn Purnea district's Baisi, which the RJD won in 2020, the AIMIM emerged victorious by 27,251 votes in the 2025 Bihar Vidhan Sabha polls.\nAt Kishanganj's Kochadhaman, BJP candidate Bina Devi was trounced by the AIMIM's Sarwar Alam by 37,002 votes.\nBina Devi finished in third place, following the AIMIM and the RJD.\nThis is the biggest vote margin by which a BJP candidate lost in the 2025 Bihar polls.\nTo the west, in the Mithila-Koshi belt, the BJP faced two defeats, including in Saharsa, where the BJP had won four out of the last five Assembly pols.\nAt Bisfi, the RJD's Asif Ahmed defeated the BJP's former MLA Haribhushan Thakur by a margin of 8,107 votes.\nIn Saharsa, the IIP, (a Mahagathbandhan ally) won by 2,038 votes, showcasing a transfer of RJD votes to the smaller ally.\nSIX BJP DEFEATS IN BIHAR CAME FROM CHAMPARAN, TIRHUT, BHOJPUR REGIONS\nThe remaining six BJP defeats in the 2025 Bihar Assembly polls came from other regions across the state, with one seat going to the Mayawati-led BSP.\nIn Sehohar district's Dhaka, the RJD's Faisal Rahman defeated the BJP's Pawan Kumar by a narrow margin of 178 votes.\nIn the Ramgarh in Kaimur district, which borders Uttar Pradesh, the BSP's Ashok Kumar Singh won by just 30 votes.\nHere, the BJP's incumbent MLA Ashok Kumar Singh faced defeat after votes were divided among the saffron party, the RJD and the Prahant Kishor-led Jan Suraaj.\nAt Raghopur, where RJD leader Tejashwi Yadav was in the fray, the BJP's Satish Kumar faced a defeat by a margin of 14,532 votes in the high-profile seat.\nThis is a seat where RJD bigwigs, Lalu Prasad, Rabri Devi and Tejashwi, have won repeatedly.\nIn Champaran's Chanpatia, where Jan Suraaj's Manish Kashyap (a YouTuber) was contesting, the Congress defeated the BJP's Umakant Singh by just 602 votes.\nWith the votes split among Kashyap and Congress' Abhishek Ranjan, the BJP fell short in the close contest.\nIn Magadh's Goh seat, the RJD's Amrendra Kumar, defeated the BJP's Ranvijay Kumar by a margin of 4,041 votes.\nTo the east, in Warsaliganj, the BJP's Aruna Devi defeated the RJD's Anita by 7,543 votes.\nThese were the 12 seats where even the mighty BJP couldn't muscle through.\nIn the 2025 Bihar polls, the BJP contested 101 seats as part of the NDA, and won 89, clocking an impressive 88% strike rate.\nNot just the BJP, but the NDA allies achieved remarkable strike rates in the 2025 Bihar Assembly elections.\nThe Nitish Kumar-led JD(U) won 85 out of 101 at 84%, while the Chirag Paswan-led LJP(RV) clinched 19 out of 23 at 83%.\nThe HAM(S), led by former Bihar CM Jitan Ram Manjhi, won five out of six seats at 83%.\nThese parties collectively powered the coalition to a landslide.\nThough the BJP emerged as the single largest party, pipping the RJD, the saffron juggernaut stumbled on 12 seats.\nThe defeats came mostly in RJD strongholds and close-fought pockets with heavy Yadav or Muslim influence, despite a statewide landslide of 202 seats for the NDA.\nBihar 2025 election result: Who won, who lost, why it matters\nModi’s BJP-led alliance poised to sweep the legislative assembly election in Bihar, vote count trends show.\nThe National Democratic Alliance (NDA), led by Indian Prime Minister Narendra Modi’s Bharatiya Janata Party (BJP), is heading for a sweep in the legislative assembly elections in the eastern state of Bihar.\nThe election in India’s third-most populous state, with 74 million registered voters across 243 assembly constituencies, has been viewed as a key test of Modi’s popularity, especially among Gen Z: Bihar is India’s youngest state.\nlist of 3 items- list 1 of 3‘Bangladeshi infiltrator’: Indian Muslims in poll-bound Bihar battle hate\n- list 2 of 3India’s Bihar elections start with 74 million voters: What’s at stake?\n- list 3 of 3Bihar election: Can Modi buck Gen Z rage in India’s youngest state?\nVote counting concluded on Friday after two phases of voting on November 6 and November 11.\nHere is more about the election results and what they mean.\nWhat was the result of the Bihar election?\nAs of 5:30pm (1200 GMT) on Friday, the NDA had won two seats and was leading in 204 out of 243, while the opposition Mahagathabandhan, or the Grand Alliance, with the Indian National Congress and the regional Rashtriya Janata Dal (RJD) as the main parties, was leading in just 33 seats, according to the Election Commission of India (ECI).\nThe Bahujan Samaj Party (BSP), which is currently not part of either alliance, was leading in one seat.\nThe All India Majlis-E-Ittehadul Muslimeen (AIMIM), another party that does not belong in either major alliance, had won or was leading in the remaining five seats.\n- Within the NDA, the BJP had won or was leading in 93 seats with a 20.5 percent overall vote share.\n- The regional Janata Dal (United) or JD(U), a key NDA constituent, had won or was leading in 83 seats, with 19 percent votes overall.\n- Another local NDA ally, the Lok Janshakti Party (Ram Vilas) or LJPRV, had won or was ahead in 19 seats.\n- The Rashtriya Lok Morcha (RSHTLKM) was leading in four seats.\n- The Hindustani Awam Morcha (Secular), or HAMS, had won or was leading in five seats.\n- The Congress, India’s main opposition party, had won or was leading in five seats with 8.7 percent of the overall vote.\n- The Grand Alliance’s biggest party, RJD, had or was leading in 26 seats with 22.8 percent of the vote.\n- The Communist Party of India (Marxist-Leninist) (Liberation), or CPI(ML)(L), was leading in one seat.\nHow are Tejashwi Yadav and Maithili Thakur doing?\nAs votes were being counted, two of the most watched constituencies were Raghopur and Alinagar.\nRaghopur has long been an RJD stronghold.\nBut for some time during counting, Tejashwi Yadav, the son of RJD leader Lalu Prasad Yadav and the party’s de facto chief now, was trailing behind BJP candidate Satish Kumar in the Yadav family bastion.\nThis had switched to a 13,000 vote lead for Yadav by 1200 GMT, with most votes counted.\nIf Yadav were to still lose, it will be a historic defeat for what was, many years, the first family of Bihar.\nHe previously won the seat in 2015 and 2020.\nHis father has also won from Raghopur twice in the past, while his mother, Rabri Devi, has won it three times.\nPopular folk singer, Maithili Thakur, representing the BJP, was leading in the Alinagar seat, with the RJD’s Binod Mishra trailing by 8,588 votes — another close contest.\nPolitical analysts attribute the gains for the key governing party in this election to the appeals Modi’s party has made to female voters.\nIn September, the BJP transferred about $880m to 7.5 million women – with 10,000 rupees ($112.70) paid directly into their bank accounts – under a seed investment programme called the Chief Minister’s Women Employment Scheme.\nModi’s office said: “The assistance can be utilised in areas of the choice of the beneficiary, including agriculture, animal husbandry, handicrafts, tailoring, weaving, and other small-scale enterprises.”\nWomen make up nearly half of all eligible voters in Bihar, where women’s political participation is on the rise.\nFemale representation in the state has historically been low.\nBut in 2006, Bihar reserved 50 percent of seats on local bodies for women, which has boosted their political representation.\nFemale voter turnout in the state has often surpassed that of men since 2010.\nThe turnout among women this time was 71.6 percent, compared with 62.8 percent for men.\nThe opposition has also accused the ECI of deliberately revising the official voter list to benefit the BJP via a Special Intensive Revision (SIR) of the electoral rolls over the past few months.\nRegistered voters were required to present documents proving they were Indian nationals and legal residents of the constituency in which they voted.\nAs Al Jazeera reported in July, however, many of the poorest people in Bihar do not hold any of the several documents that the ECI listed as proof of identity.\nThe opposition argues, therefore, that this new requirement could disenfranchise poor and vulnerable groups, including disadvantaged castes and Muslims, who typically vote for the RJD-Congress alliance.\nIn September, the ECI removed 4.7 million names from Bihar’s rolls, leaving 74.2 million voters.\nIn Seemanchal, a Muslim-majority area, voter removals exceeded the state average.\nWhat is the significance of these results?\nBihar is India’s third most populous state, home to 130 million people.\nIt sends the fifth-highest number of legislators to parliament.\nThe latest vote has been viewed as a key popularity test for Modi, who was sworn in for his third premiership after he won the national elections in June 2024.\nBut the BJP failed to secure a majority in the national election on its own, forcing it to rely on regional allies such as the JD(U) to form the government.\nSince the national election, the BJP has won most major state elections, and the streak seems to be continuing in Bihar."
    },
    {
      "cluster_id": 1,
      "article_count": 4,
      "sentences_kept": 113,
      "text": "The 2025 Bihar Assembly election results , announced on 14 November 2025, saw the BJP-led NDA coalition secure 202 out of 243 seats.\nThe MGB alliance (comprising Congress, RJD, and other parties) won 35 seats, while other parties claimed 5 seats.\nIn this context, a widely circulated social media post ( here , here , here & here ) claims that the voter turnout exceeded 100%, alleging that 7.45 crore votes were cast despite there being only 7.42 crore registered voters for the 2025 Bihar Assembly elections.\nLet’s verify the claim made in the post.\nClaim: The number of votes polled exceeded the number of eligible voters in the 2025 Bihar Assembly elections.\nFact: According to the Election Commission’s final revised data, Bihar had around 7.45 crore registered voters for the 2025 assembly elections.\nThe voter turnout was 67.13%, and the total number of votes cast, including postal ballots, was 5.0185 crore.\nTherefore, the claim made in the viral post is False .\nThe Election Commission of India carried out a Special Intensive Revision ( SIR ) to update and refine the voter list for the 2025 Bihar Assembly elections.\nThis process started on 24 June 2025 and concluded with the release of the final revised list on 30 September 2025.\nAs per this list, the Commission identified about 7.42 crore voters in the state.\nHowever, the Chief Election Commissioner Gyanesh Kumar, during a press conference on 5 October 2025, announced that individuals whose names were missing from the voter list could still apply for inclusion up to ten days before the final deadline, i.e, between 10 October and 20 October 2025.\nSimilarly, the election schedule released by the Election Commission on 6 October 2025 mentioned that the number of registered voters at that time was 7,43,55,976.\nThis number reflects only the eligible voters on the electoral roll, not the votes cast.\nThe Commission also said that the initial polling percentage at that time—excluding service voters, transgender voters, and postal ballots—was 66.91%, and that data from 2,027 polling stations was still pending.\nAccording to the Election Commission’s press note issued on 13 November 2025, the updated voter turnout is 67.13%.\nThis means that out of 7.45 crore registered voters, only about five crore actually cast their votes.\nHere, it’s essential to note that the term “electors” in the press note refers to individuals who are eligible to vote, not those who have already cast their votes.\nThe party-wise and constituency-wise votes polled, including postal ballots, are available on the Election Commission’s website .\nBased on this data, it is clear that the claim- more votes were cast than the number of voters is not true.\nBehind the ruling NDA’s landslide return to power in the Bihar Assembly elections lie record high victory margins, particularly for the Chief Minister Nitish Kumar-led Janata Dal (United).\nThis year, the winning candidates in Bihar set new state records for average margin as well as median margin (which refers to the midpoint of the margins recorded across all seats, eliminating the impact of outliers that tend to skew the average figures).\nWhile the average victor’s margin is 20,940 votes, the median margin is 18,510, breaking the previous records set in the 2015 Assembly polls.\n[Historical margins in Bihar] The JD(U), for instance, nearly doubled its seat tally – from 43 in 2020 to 85 now – and saw its average winning margin rise from under 12,300 votes to over 23,620 votes.\nThe party also improved its media margin from 10,440 votes to 22,550 votes this time.\nThis turnaround was most likely impacted by the Chirag Paswan -led Lok Janshakti Party (Ram Vilas)’s return to the NDA fold after contesting the 2020 elections independently and cutting into the JD(U)’s votes in 32 seats.\nAmong the two major alliances, while the JD(U) recorded the highest margins, the BJP followed it with an average margin of 23,000 votes and a median margin of 21,860 votes, en route to emerging as the single-largest party with 89 seats.\nThe BJP, too, improved on its performance in 2020, when its average margin was 19,360 votes and median margin was 16,300.\nThe LJP(RV)’s performance was particularly notable for its marked improvement from 2020, when it won just 1 seat with a narrow margin of 333 votes.\nThis time, the party won 19 of the 28 seats it contested, with an average margin of 20,930 votes and a median margin of 20,320 votes.\nHowever, in the Opposition Mahagathbandhan, the Tejashwi Prasad-led Rashtriya Janata Dal (RJD) suffered a major drop-off from 2020, when it had emerged as the single-largest party with 75 seats.\nThis time, it has managed just 25 seats, winning them by an average margin of 10,190 votes and a median margin of 8,110 votes.\nIn comparison, the party had recorded an average margin of 16,360 votes and a median margin of 13,690 votes in the 2020 polls.\nMeanwhile, the Congress’s abysmal performance that saw it drop to 6 seats from 19 in 2020 was also exemplified by its reduced winning margins.\nWhile its average margin dropped from 13,550 votes in 2020 to 7,200 votes this time, its median margin rose slightly from 6,330 votes to 7,210.\nHowever, among the parties that won any seats this time, it was the AIMIM that had the highest average margin at 29,350 votes and highest median margin at 28,730 votes in the 5 seats that it won this time.\nOn an individual seat level, the highest margin was recorded by the JD(U)’s Kaladhar Prasad Mandal in Rupauli at 73,572 votes.\nThe JD(U) has won the Rupauli seat in consecutive elections since 2010.\nIn 15 seats – all won by the NDA – the margin exceeded 50,000 votes.\nIn fact, the Mahagathbandhan’s highest margin was secured by RJD’s Shankar Prasad in Paroo at 28,827 votes, good enough only to be the 63rd highest margin in the state.\nThe low-margin seats With Bihar recording its highest ever voter turnout, there were 31 seats where the winner and runner-up were separated by less than 5,000 votes, including 11 seats where the margin was below 1,000 votes.\nIn these 31 low-margin seats, the Mahagathbandhan lost 16 seats, the NDA in 14 seats, and the AIMIM in 1 seat.\nThe RJD lost the most such seats at 13, followed by the BJP at 6, the JD(U) at 4, the LJP(RV) and CPI(M-L)L at 3 each, the Hindustani Awam Morcha (Secular) and AIMIM at 1 each.\nThe winners in these 31 seats include the JD(U) in 9 seats, RJD in 8 seats, BJP in 4 seats, LJP(RV) and Congress in 3 seats each, and the Rashtriya Lok Morcha, CPI(M-L)L, BSP and Indian Inclusive Party (IIP) in 1 seat each.\nThe I P Gupta-led IIP is part of the Mahagathbandhan.\n[Low-margin seats] In the Sandesh seat, which saw the closest contest of this election, the JD(U)’s Radha Charan Sah defeated the RJD’s Dipu Singh by 27 votes.\nIn this seat, Jan Suraaj candidate Rajiv Ranjan Raj spoiled the RJD’s prospects by securing 6,040 votes and finishing in third place.\nHere, NOTA also polled a sizeable 4,160 votes.\nThe RJD had won this seat in 2020 by a 50,607-vote margin.\nIn another closely contested RJD bastion of Ramgarh in the Kaimur district, the BSP secured its only seat with candidate Satish Yadav defeating the BJP’s Ashok Kumar Singh by 30 votes.\nIn this seat, the RJD’s Ajit Kumar placed third with 41,480 votes, and the Jan Suraaj’s Anand Kumar Singh placed fourth with 4,426 votes, while NOTA received 1,154 votes.\nIn the SC-reserved Agiaon seat, the BJP’s Mahesh Paswan won by a margin of just 95 votes ahead of the CPI(M-L)L’s Shiv Prakash Ranjan.\nHere, even NOTA exceeded the margin with 3,631 votes.\nThe JD(U)’s Chetan Anand won the Nabinagar seat by 112 votes, defeating the RJD’s Amod Kumar Singh.\nIn the Dhaka seat, the RJD’s Faizal Rehman emerged as the winner with a margin of 178 votes over the BJP’s Pawan Kumar Jaiswal.\nThe Congress that won only six seats in the state saw its Forbesganj candidate Manoj Biswas win by 221 votes, defeating the BJP’s Vidhya Sagar Keshari.\nIn Chanpatia, the Congress’s Abhishek Ranjan won by 602 votes ahead of the BJP’s sitting MLA Umakant Singh.\nIn a very close triangular contest in Balrampur, AIMIM spokesperson Mohd Adil Hasan lost by 389 votes as LJP(RV) candidate Sangita Devi won.\nHere, the sitting CPI(M-L)L MLA Mahboob Alam finished in third place.\nThe RJD’s Rahul Kumar won Jehanabad seat by 793 votes as he defeated the JD(U)’s Chandeshwar Prasad.\nIn SC-reserved Bodh Gaya, sitting RJD MLA Kumar Sarvjeet retained the seat by defeating LJP(RV) candidate Shyamdev Paswan by 881 votes.\nLJP(RV) candidate Arun Kumar won the Bakhtiarpur seat by defeating the RJD’s sitting MLA Aniruddh Kumar by 981 votes.\nThe verdict delivered in Bihar has produced what can only be described as an unprecedented incumbent tsunami.\nCommentators have rushed to frame this as the triumph of a labharthi wave—a grateful electorate rewarding Nitish Kumar’s last-minute cascade of welfare initiatives: free electricity up to 125 units and the transfer of Rs.10,000 into the accounts of nearly 1.25 crore women associated with the Jeevika network.\nSocial media, drawn to the seduction of singular explanations, has already converted this into a neat causal story of welfare translating into votes.\nYet to rest at this explanation is to miss the forest for the trees.\nWelfare may have functioned as a palliative, a convenient ointment to soften dissatisfaction and nudge undecided voters.\nBut the skeletal frame on which Bihar’s politics rests—the decisive architecture that gives shape, durability, and direction to electoral outcomes—is the social coalition a party is able to stitch together.\nWhen viewed through that lens, the scale of the National Democratic Alliance’s (NDA) victory becomes less mysterious and more inevitable.\nWhat unfolded in this election is the story of demography, the quiet consolidation of caste alliances that had been gathering force beneath the electoral surface.\nChirag Paswan’s return to the NDA was the single most consequential development in the run-up to these elections.\nEvery grounded observer of Bihar’s politics sensed that this would give the NDA a superior coalition on the ground.\nWhat remained uncertain was the convertibility of each of the social groups into a stable additive force and whether this improbable coalition of extremes—with upper castes at one end and non-Yadav OBCs and Dalits at the other—would hold in practice.\nThat it not only held but delivered benefits of this magnitude is what has rendered this election so startling.\nThe numerical contours of the verdict are astonishing even by Bihar’s volatile standards.\nThe NDA secured 202 seats—nearly 83 per cent of the Assembly—on a vote share of 46.6 per cent.\nIn contrast, the Mahagathbandhan, despite a respectable 37.9 per cent vote share, could manage only 35 seats.\nMany analysts, in their eagerness to find patterns, have compared this election to 2015 and 2020 Assembly elections.\nBut both those elections operated on fundamentally different coalitional logics.\nThe 2015 election was fought with the Janata Dal (United) (JD(U)) and Rashtriya Janata Dal (RJD) aligned in a backward-class meta-coalition, a configuration too specific to be of use today.\nIn 2020, the JD(U) fought with the NDA but was internally sabotaged by the Lok Janshakti Party, a manoeuvre executed with the singular aim of undermining Nitish Kumar.\nAlso Read | Landslide victory shapes up for NDA, MGB blames EC\nThe only meaningful benchmark, therefore, is the 2010 election, when the BJP-JD(U) alliance, commanding a broad coalition of upper castes, non-Yadav OBCs, EBCs, and non-Paswan Dalits, swept the State with 206 seats but on a far lower vote share of 39 per cent.\nThose quick to insinuate electoral fraud would do well to revisit the 2010 numbers, particularly the BJP’s astonishing 91 of 102 seats.\nWhat we are witnessing today is a return of that same coalition logic, fortified by the full reintegration of the Paswan bloc and aided by the bipolarity that squeezed out independents.\nThat the Mahagathbandhan could maintain 37.9 per cent vote share and still collapse to 35 seats is a reminder of the first-past-the-post system’s peculiarities: stable vote share is no shield against an opponent whose social coalition is more evenly dispersed across the electoral map.\nThe NDA’s broad pyramid—upper castes, Kurmis, Koeris, EBCs, Paswans, and sections of non-Paswan Dalits—yielded a distributional advantage that the narrower MY-based coalition could not counter.\nIn essence, the NDA reconstructed the core architecture of 2010 and added to it the missing Dalit flank, producing an outcome that surprised even its architects.\nThe implications of this mandate for Bihar’s political field are profound.\nFirst, Nitish Kumar’s celebrated manoeuvrability—the capacity to play both sides, borne out of seat arithmetic and the ever-present possibility of defection—has been effectively curtailed.\nUnlike 2010, when his dominance allowed him leverage within the coalition, or 2015 and 2020, when the size and distribution of opposition seats left multiple escape routes, the 2025 verdict leaves him with no such openings.\nThe BJP’s overwhelming numerical superiority gives it, for the first time, the undisputed authority to discipline the coalition at will.\nNitish Kumar remains central, but the axis of gravity has unmistakably shifted.\nSecond, the social profile of the new Assembly reveals a telling pattern: a marked increase in the number of upper-caste MLAs, a robust presence of non-Yadav OBCs, and a significant strengthening of EBC representation—a coalition of extremes that has now become the foundational grammar of Bihar’s electoral politics.\nThis is the same architecture that Nitish Kumar cultivated over two decades and has become synonymous with him.\nThat this structure has outlasted twenty years of Lalu Prasad Yadav’s subaltern politics underscores a rarely acknowledged truth: Bihar’s counter-coalition—upper castes, non-Yadav OBCs, and EBCs bound together in an anti-Yadav, non-Muslim compact—has proven more stable than the subaltern solidarity that once threatened to overthrow the old order.\nThird, the rise of All India Majlis-e-Ittehadul Muslimeen (AIMIM) in Seemanchal, across districts like Purnea, Araria, Katihar and Kishanganj, reflects a quiet reorientation in Muslim political behaviour.\nThe longstanding secular compact, in which Muslims voted for the Congress or the RJD to keep the BJP out, gradually allowed these parties to treat Muslim support as a given rather than as a constituency requiring genuine socio-political inclusion.\nAIMIM’s appeal grows from this neglect.\nIn seats with a large Muslim population, voters now gravitate to a co-ethnic party that articulates their fears and aspirations more directly.\nThis shift fragments what was once a consolidated bloc, signalling the exhaustion of the old secular consensus.\nThe Muslim vote is no longer automatically embedded in the logic of counter-majoritarian democracy; it is attempting instead to construct its own autonomous political space.\nTaken together, these shifts indicate that the era of an older imagination of united subaltern solidarity—the Mandal-era vision of a collective lower-caste bloc confronting entrenched privilege—is over.\nBihar has now truly entered what can only be called a post-subaltern moment: a phase where the emancipatory ideological energies that once animated its politics have been replaced by transactional alignments, structural closures, and the cold calculus of caste arithmetic.\nThe NDA’s tsunami is not merely a victory of incumbency; it is a reaffirmation of a new caste calculus, one in which older solidarities have dissolved, and the political imagination has narrowed into a contest between competing vertical coalitions.\nSupriy Ranjan is an Assistant Professor at GITAM University, Hyderabad, and associated with People’s Pulse, a Hyderabad-based research organisation.\nC ongress leader Rahul Gandhi met party president Mallikarjun Kharge to discuss the Bihar Assembly election result on Saturday (November 15, 2025), a day after the opposition party faced a drubbing in the State.\nThe National Democratic Alliance (NDA) returns to power in Bihar after the ruling coalition led by Chief Minister Nitish Kumar registered a landslide victory and secured the people’s mandate, crushing the opposition Mahagathbandhan in the State Assembly election results on Friday (November 14, 2025).\nNDA’s total vote share stood at 46.7%, while the INDIA bloc was 37.5%.\nAlso read | Bihar election results: A women-powered victory for Nitish Kumar\nAs per the latest Election Commision of India numbers, the NDA won with a three-fourth majority, securing 202 seats of the 243-member Assembly (BJP 89, JD(U) 85, LJP (RV) 19, HAM (S) 5 and RLM 4).\nThe Mahagathbandhan, facing a total collapse, managed to win only 35 (RJD 25, INC 6, CPI(ML)(L) 2, CPI(M) 1, IIP 1) and the Owaisi-led AIMIM won five seats.\nPrashant Kishor’s Jan Suraaj failed to open its account in its debut electoral run.\nOn the mandate, Congress leader Rahul Gandhi said the results are “truly surprising” and said “we could not achieve victory in an election that was not fair from the very beginning”.\nHe also said the INDIA bloc will conduct an in-depth review of the poll results and make more effective efforts to save democracy."
    },
    {
      "cluster_id": 2,
      "article_count": 4,
      "sentences_kept": 83,
      "text": "One of the most closely watched trends in the Bihar 2025 Assembly Elections was the Congress party’s performance within the Mahagatbandhan (grand alliance).\nIn the 2020 elections, the party had recorded the lowest contested vote share and strike rate among the alliance’s major partners.\nThe weak performance of the Congress in the 2020 polls was one of the main reasons behind the close contest that year.\nData shows that the Congress’ poor performance continued in 2025 and, in fact, further worsened.\nThis trend becomes clearer when looking at the strike rate, which is calculated by dividing the number of seats a party won by the number of seats it contested.\nThe table below shows the strike rate of major parties in the 2025 Bihar Assembly Elections, 2020 Assembly Elections and the 2024 Lok Sabha elections (assembly segments were used)\nAs seen in the table, the Congress’ strike rate in the 2025 polls was 9.8%, the lowest among all Mahagatbandhan alliance partners once again, though the Communist Party of India (Marxist–Leninist) Liberation’s strike rate was only slightly higher at around 10%.\nThe Congress’ strike rate has fallen from over 27% in 2020 and over 22% in 2024.\nThe JD(U), too, improved its strike rate from 74% in 2024 to more than 82% in 2025.\nCongress has recorded its weakest performance within the Mahagatbandhan once again.\nWith a strike rate of 9.8% and a decline in its contested vote share, the party has slipped further in the 2025 Bihar Assembly Elections.\n#BiharElection2025 #Congress #Mahagatbandhan #ElectionResults\nAnother indicator of this decline is the contested vote share — the percentage of votes a party secures in the constituencies it contests.\nIn the 2025 Bihar Assembly Elections, the Congress’ contested vote share of 34.1% was lower than the Rashtriya Janata Dal’s 38.9%.\nIt is also lower than the CPI (ML)(L)’s contested vote share of 35.8%.\nMoreover, the Congress’ contested vote share has declined from the 41.2% it recorded in the 2024 Lok Sabha elections.\nThe table below shows the contested vote share of parties and alliances in the 2025 Bihar Assembly Elections, 2020 Assembly Elections and the 2024 Lok Sabha elections (assembly segments were used)\nThe spoiler effect created by Asaduddin Owaisi’s All India Majlis-e-Ittehadul Muslimeen (AIMIM) and Prashant Kishor’s Jan Suraaj Party, also played a role in the decline of Congress’ vote share.\nPublished - November 14, 2025 07:16 pm IST\nThis is a Premium article available exclusively to our subscribers.\nTo read 250+ such premium articles every\nArticles older than 1 year are a part of The\nHindu archives,available only to our premium\nYou have exhausted your free article limit.\nPlease support quality journalism.\nYou have exhausted your free article limit.\nThis is your last free article.\nWe’re glad this article found its way to you.\nIf you’re not a subscriber, we’d love for\nyou to consider subscribing—your support helps make this journalism possible.\nEither way,\nBihar’s eighteenth assembly election was held, on 6 and 11 November, under extraordinary circumstances.\nIt was preceded by the Election Commission of India conducting a Special Intensive Revision of the state’s voter rolls—an exercise that the ECI is poised to conduct nationwide in the near future.\nAs my colleague Sagar reported in the August issue of The Caravan , there are serious questions about the necessity, design and execution of the SIR process, which could not only disenfranchise people who do not have the required documents but also cast doubt on their citizenship status.\nPetitioners challenging the SIR in the Supreme Court estimated that around 1.75 million Muslims were excluded from the electoral rolls, making up over a quarter of all deletions in a state where they constitute a sixth of the population.\nThe ECI disputed the methodology used to arrive at this estimate but refused to reveal the caste and religious breakup of those who were excluded, and the legal status of the SIR remains pending in the Supreme Court even as votes are cast and counted.\nThe SIR controversy erupted amid allegations by the leader of the opposition, Rahul Gandhi, over irregularities in the electoral rolls used during the 2024 general election, in which Prime Minister Narendra Modi held on to power despite his Bharatiya Janata Party losing its parliamentary majority, and in subsequent assembly elections in Maharashtra and Haryana, both of which the BJP unexpectedly won.\nHaving been one of the few widely trusted democratic institutions in the past three decades, the ECI has increasingly come under intense scrutiny for allegedly playing a partisan role, with the Congress leader Jairam Ramesh calling it the “B-team of the BJP.”\nAlthough the opposition did not end up boycotting the Bihar election over the SIR, the issue of election integrity looms large.\nThe draft electoral rolls, published on 1 August, excluded 6.56 million voters.\nWhile preparing the final electoral rolls, the ECI added 2.15 million names despite receiving only 1.69 million requests challenging exclusions in the draft rolls or seeking enrolment as a new voter.\nIt also deleted a hundred and fifty thousand more names than it received exclusion applications.\nThe Congress alleged, and Scroll confirmed, that the ECI has disproportionately appointed bureaucrats and police officials from BJP-ruled states to act as its observers.\nMoreover, Jairam pointed out, “in some assembly constituencies, the number of voters’ names being deleted exceeds the victory margin from the previous elections.”\nThose margins are extremely thin.\nIn the last assembly election, in 2020, the National Democratic Alliance won 125 seats—three more than required for a majority.\nChirag Paswan’s Lok Janshakti Party fought that election separately, splitting the NDA vote.\nHypothetically, even if the LJP’s 2020 vote is added to that of the NDA, a uniform swing of five percentage points to the opposition Mahagathbandhan would see the ruling alliance lose 42 of those seats.\nThe LJP has since split, but both factions remain within the NDA, which would gain 60 seats with a swing of just one point in its favour.\nThanks for reading till the end.\nIf you valued this piece, and you're already a\nsubscriber, consider contributing to keep us afloat—so more readers can access work like\nthis.\nClick to make a contribution: Contribute\nThe Congress-RJD coalition failed to function as an organic platform, and its lack of cohesion and sense of purpose were all too evident.\nIts campaign was splintered, with its attention shifting between social justice and welfare slogans and a questioning of the integrity of the electoral process itself.\nIndia’s electoral process requires serious refurbishment, but does not seem to have much traction as an election issue.\nAlso missing among the opponents of the BJP is an appreciation of the hegemony of Hindutva in the Hindi belt.\nThere are many questions regarding the impartiality of the electoral process, but the conclusion that the BJP and its allies are winning only because of a compromised process is a misplaced one.\nWhile the NDA could mitigate the pitfalls of anti-incumbency, the Mahagatbandhan ended up holding the can for the misdeeds and misgovernance of a previous generation of its leaders.\nThat is a sobering message for the Congress and all parties opposed to the BJP.\nThey need to get their house in order, craft an inspiring message, and face up to the popularity of the BJP’s Hindutva politics while framing their opposition to it.\nStory so far: While the National Democratic Alliance (NDA) swept Bihar winning 202 seats on Friday (November 14, 2025), there are ten seats on which the victory margin was less than 1000 votes.\nFor the Mahagathbandhan , which won only 35 seats, five of these victories came from – Bodh Gaya (881 votes), Jehanabad (793 votes), Dhaka (178 votes), Forbesganj (221 votes) and Chanpatia (708 votes).\nThe coalition has alleged ‘vote chori’ and promised to produce ‘concrete proof within two to three weeks’ after studying data across Bihar.\nFor the NDA, BJP won 89 seats, JDU(85 seats), LJP(RV) (19 seats), HAMS (5 seats) and RLM (4 seats).\nOf these 202 seats, five victories were closely fought – Nabinagar (112 votes), Sandesh (192 votes), Agiaon (95 seats), Balrampur (389 votes) and Bakhtiarpur (980 votes).\nBSP’s sole victory was also won by a wafer-thin margin – 30 votes.\nBodh Gaya : Three-time RJD MLA Kumar Sarvajeet won by a margin of 881 votes against LJP (RV)’s Shyamdeo Paswan.\nSarvajeet, who won the seat for LJP in 2005 and for the RJD in 2015 and 2020, polled 1,00,236 votes\nJehanabad: Incumbent RJD MLA Rahul Sharma barely managed to retain his seat by defeating JDU’s Chandeshwar Prasad by a margin of 793 votes and polling 86,402 votes.\nA stronghold for the RJD since 1995 (except 2010-2015), Jehanabad’s battle was tough as JDU had fielded Mr.\nPrasad - an ex-MP from Jehanabad.\nThe exit of RLJP from the Mahagathbandhan made it tricky for RJD to retain the Paswan vote in the area.\nDhaka: The closest battle for MGB was seen in this East Champaran seat where RJD’s Faisal Rahman managed to regain his seat defeating BJP’s Pawan Jaiswal by a mere 178 votes.\nRahman have been contesting against each other for Dhaka since 2010, alternately winning the seat.\nJaiswal won the seat as an Independent and a BJP candidate respectively, while in 2015 and 2025, Mr.\nJaiswal in 2010 on a JDU ticket.\nForbesganj: Congress’ Manoj Bishwas managed to wrest the seat from incumbent BJP MLA Vidya Sagar Kesari by a margin of 221 votes.\nBishwas, a poll debutant, got 1,20,114 votes and managed to wrest away the BJP stronghold which it has held since 1990s (except 2000).\nChanpatia : Another close victory was won by Congress’ Abhishek Ranjan - a newbie, by defeating incumbent BJP MLA Umakant Singh by a margin of 602 votes.\nRanjan managed to wrest away the seat from BJP which has held it since 2000.\nNabinagar : A swing seat falling under Aurangabad region, JDU’s Chetan Anand won Nabinagar, defeating RJD’s Amod Kumar Singh by a margin of 112 votes.\nSince 1995, the mandate has been switching between JDU and RJD - with the former winning it in 2010, 2015 and 2025 and the latter in 2000, 2005 and 2020.\nSandesh: Breaking the RJD-Left hegemony in this Bhojpur seat, JDU’s Radha Charan Sah won by a margin of 192 votes, defeating RJD’s Dipu Singh.\nSince 1985, this seat has either been held by Communist Party of India (Marxist–Leninist) Liberation (1995, 2005) or RJD (2000, 2005, 2015, 2020).\nAgiaon: Regaining an old BJP seat from the Left, the party’s Mahesh Paswan won the Bhojpur seat by a small margin of 95 seats, defeating incumbent CPI(ML) Liberation MLA Shiv Prakash Ranjan.\nBakhtiarpur: A key swing seat in the Patna region, Chirag Paswan’s LJP(RV) managed to win it for the NDA defeating incumbent RJD MLA Aniruddha Kumar by 981 votes.\nSince 1995, the seat has been won alternately either by RJD or BJP.\nBalrampur: Falling under the Katihar district, this Seemanchal seat saw a three-way battle between LJD(RV)’s Sangita Devi, incumbent CPI(ML) Liberation MLA Mahbub Alam and AIMIM’s Mohammad Adil Hasan.\nBy a mere 389 votes, Sangita Devi managed to win the seat, while Mr.\nHasan, who polled 80,070 votes, finished second.\nAlam lost the seat by 1318 votes, polling 79,141 votes.\nApart from the two coalitions, the Bahujan Samaj Party, which had contested on 192 of the 243 seats, snatched its lone victory in Ramgarh by a mere 30-vote margin.\nBSP’s Satish Kumar Singh Yadav defeated incumbent BJP MLA Ashok Kumar Singh and RJD’s Ajit Kumar.\nThis seat, which has been won by RJD since 1985 (except 2015 and 2024), came as a facesaver for BSP which has been reduced to single-seat victories in Bihar since 2005.\nPublished - November 15, 2025 07:11 pm IST\nThis is your last free article."
    },
    {
      "cluster_id": 3,
      "article_count": 5,
      "sentences_kept": 444,
      "text": "Bihar election results 2025 live: Bihar BJP chief Dilip Jaiswal meets Nitish Kumar at CM's residence\nBihar election results 2025 live: The ruling NDA secured 202 seats, a three-fourths majority in the 243-member House.\nThe BJP won 89 seats, becoming the single largest party in Bihar.\nLeaders in the NDA said on Saturday that the government formation in Bihar would take place in two or three days.\nBihar BJP president Dilip Jaiswal also reached CM Nitish Kumar's residence to meet and congratulate him.\nMeanwhile, the Yadav family is facing another major crisis aside from the defeat in the polls.\nLalu Prasad Yadav’s daughter and RJD leader Rohini Acharya said on Saturday that she was quitting politics.\n- The RJD suffered a major loss as what was once the single largest party despite being in the opposition has now been reduced to 25 seats.\n- NDA leaders told HT on Saturday that the government formation process would begin in two to three days, once all victorious MLAs, many of whom were still in their constituencies, reached Patna.\nShe blamed two close aides of her brother Tejashwi Yadav for the result.\nBihar election results 2025 live: Chirag Paswan visits Patna Sahib gurdwara\nLJP(RV) chief Chirag Paswan on Sunday visited the Takhat Sri Harimandir Ji Patna Sahib, along with his family, PTI news agency reported.\nPaswan, who was wearing an orange turban, also bowed in the darbar sahib and had the ‘prasad’ at the ‘langar’.\n“I prayed to Guru Maharaj for peace, prosperity, and the welfare of all in Bihar,” Paswan said.\n“Earlier I was not able to meet the Chief Minister, so today I went to congratulate the Chief Minister,” ANI news agency quoted Jaiswal as saying.\nThe state BJP chief also said that the NDA had an “overwhelming majority” in the Bihar Assembly.\nBihar election results 2025 live: After Rohini Acharya's emotional post, brother Tej Pratap says people of Bihar will ‘bury’ those who attack family\nLalu Prasad Yadav's eldest son and JJD leader Tej Pratap Yadav on Sunday reacted to sister Rohini Acharya's emotional statement saying she was “quitting” politics, and that she had been abused and humiliated.\nHe said that the incident had shaken him “to the core”, while calling the insult to his sister “unbearable”.\nAddressing certain people who he described as responsible for causing rift within the family, he said the residents of Bihar would never forgive them.\nHe said that these people had also “clouded” the judgement of his younger brother, Tejashwi Yadav.\n“The consequences of this injustice will be grave,” Tej Pratap said in a post on his party's official Instagram handle.\nHe further asked his father to relay “one signal”, adding that the people of Bihar would “bury” those accountable for the rift on a single “hint” from Lalu.\nHe further asserted that this was not a fight within a political party, but one regarding a family's dignity and a daughter's pride.\nBihar election results 2025 live: ‘List of 243 elected MLAs given to Governor, MCC has now ended,’ says Bihar CEO\nBihar chief electoral officer Vinod Singh Gunjiyal has said that the election process for the state assembly is now complete.\n“We have provided the list of 243 elected MLAs to the Governor,” ANI news agency quoted Gunjiyal as saying.\nHe said that the Model Code of Conduct has ended, adding that further action would now be communicated by the Governor's office.\nBihar election results 2025 live: BJP leader Samrat Choudhary reaches CM Nitish Kumar's residence\nBJP leader and Bihar deputy chief minister Samrat Choudhary arrived at CM Nitish Kumar's residence today to meet the JD(U) chief.\nAccording to an earlier HT report, discussions are already underway regarding government formation in Bihar.\nBihar election results 2025 live: BSP would have won more seats if elections were ‘completely free and fair’, alleges Mayawati\nBahujan Samaj Party chief Mayawati on Sunday alleged that her party would have won more seats if the polls “were completely free and fair.\"\n“…Despite giving tough competition to the opponents on other seats in this region of Bihar, the BSP candidates could not win the elections, whereas according to feedback, if the elections had been completely free and fair, the BSP would have certainly won many more seats, but that did not happen, so there is no need for the party members to be disheartened,” Mayawati said in a post on X.\nMayawati further claimed that “under the pretext of repeated vote counting, the local administration and all opposition parties united to make every possible effort to defeat the BSP candidate.” She congratulated BSP candidate Satish Kumar Singh Yadav, who won from the Ramgarh Assembly seat.\nBihar election results 2025 live: ‘NDA given such mandate on the basis of work,’ says Bihar minister Hari Sahni\nBihar minister Hari Sahni on Sunday said that the NDA “has not just given assurances but has also delivered” on them.\nSpeaking to ANI news agency, Sahni said that NDA has been given such a mandate “on basis of all the work” it has done.\nIn Bihar, where caste-based politics had been asserted, this outcome of voting in the name of development and nationalism is the result of rejecting the caste-based politics...\" he added.\nBihar election results 2025 live: ‘Public’s gift to my father,' says Nitish Kumar's son on NDA victory\nOn the NDA sweep in Bihar, CM Nitish Kumar's son Nishant Kumar said that the results were “better than expected\", PTI news agency reported.\nNishant said that the results were a “gift” that the public had given his father.\n“He (Nitish) will continue to do the good work for the development of the state,” Nishant said.\nBihar election results 2025 live: Congress shares video alleging ‘vote chori’ in Bihar, EC responds\nCongress leader Supriya Shrinate shared a video on X wherein an individual is recounting an incident alleging ‘vote theft’ in Bihar.\nIn the video, the individual is heard saying that when he was reporting at the BJP office, a party worker started speaking to him.\nHe alleged that during their conversation, the BJP worker said that he had voted at two places, and that he had received the ‘parchi’ for voting at Patna as well as his native place.\nThe individual claimed that the BJP worker disclosed to him that he went to Patna in the morning, and after voting there, cast his vote at his native village 5 km away.\nThe person further said that according to the BJP worker's account, he had removed the voting ink on his finger using the milk found in Papaya leaves.\nAfter the video was posted by Shrinate, the Election Commission asked for the voter's name, EPIC number, booth number, and assembly constituency number in order to conduct an investigation and to take action as per rules.\n“The aforementioned claim cannot be verified without any factual information.\nAppropriate legal action will be taken for spreading any kind of fake news,” the poll body wrote on X.\nBihar election results 2025 live: ‘Blueprint will be ready by today or tomorrow,’ says Chirag Paswan on govt formation\nUnion minister and LJP(RV) chief Chirag Paswan on Sunday said that blueprint for the government formation in Bihar “will be ready by today or tomorrow\", ANI news agency reported.\nHe said that he would speak with senior union ministers on the matter later today.\nA sense of clarity will come on the blueprint of the government,” Paswan said, adding that the formation will take place before November 22, before the tenure of the present legislative assembly ends.\nBihar election results 2025 live: Rahul Gandhi and Mallikarjun Kharge have conducted meetings on Bihar poll results, says Randeep Surjewala\nCongress MP Randeep Surjewala said party leader and Lok Sabha LoP Rahul Gandhi and party president Mallikarjun Kharge have conducted meetings regarding the Bihar poll results.\nSurjewala, speaking to PTI news agency, said the Congress would get in touch with its alliance partners before taking any decision.\nBihar election results 2025 live: On govt formation, RLM leader Upendra Kushwaha says things ‘will be clear in 2 to 4 days’\nRLM leader Upendra Kushwaha spoke about the government formation in Bihar, while asking the public to “wait a little.” “In the next two to four days, everything will become completely clear to you,” Kushwaha said.\nThe RLM leader further thanked the “great voters on behalf of our party and the NDA” while speaking to PTI news agency.\n“Now, the formalities for forming the new government will be completed,” Kushwaha added.\nBihar election results 2025 live: ‘In a democracy, one should accept victory and defeat with grace,’ says Telangana BJP chief\nTelangana BJP chief N Ramchander Rao on Sunday spoke about the NDA's victory in the Bihar Assembly elections.\n“The Bihar election result is the people's verdict, and in a democracy, one should accept the victory and defeat with grace,” Rao told PTI news agency.\nHe further stated that the Congress was making “wild allegations”, adding that they were not “able to digest the defeat.”\nBihar election results 2025 live: JD(U)'s winning candidate says ‘opposition should introspect’\nBihar election results 2025 live: On Bihar election results, JDU's winning candidate from Bahadurpur Seat, Madan Sahni, told news agency ANI \"...\nWe did not achieve this result overnight.\nIt is the hard work of Nitish Kumar and other top leaders of the NDA.\nWe have worked on the ground, and that is why we achieved this success.\nWomen have voted for us, but that is not the only factor.\nWe also provided reservation for women in Gram Panchayats, our government worked for young girl students, and created police vacancies for women.\nIn the future, we will continue to work towards employment opportunities.\nPeople did not trust the opposition, they trusted Nitish Kumar, who worked for the people unconditionally.\nThe opposition should introspect and understand where they went wrong...\"\nBihar election results 2025 live: RJD spokesperson says Rohini Acharya's decision is ‘family matter’\nBihar election results 2025 live: Rashtriya Janata Dal (RJD) spokesperson Mrityunjay Tiwari on Sunday said that RJD leader Rohini Acharya's decision to quit politics and disown her family is a family matter.\nTiwari added that the party's top leadership will review the situation and respond later.\nSpeaking to ANI in Patna, Mrityunjay Tiwari said, \"This is a family matter.\nMembers of the family will speak on this.\nThe party's top leadership will see this matter.\nThe election results have come out just now.\nBut why did such results come, and what were the reasons, is something that will be reviewed.\nOnly after that can we give a response.\nEveryone knows that Rohini ji set an example; everyone would want a daughter and sister like her...\"\nBihar election results 2025 live: ‘Defending it’s prince’ - BJP slams Congress' P Chidambaram over column on Bihar polls\nBihar election results 2025 live: Just days after bagging a historic victory in Bihar assembly polls, Bharatiya Janata Party sought to attack Congress leader P Chidambaram over his column on the polls and accused him of putting the blame of Opposition's poor performance on the voters of Bihar instead of Rahul Gandhi.\nWhile referring to Chidambaram's opinion piece in the Indian Express titled ‘Voting is not the end of responsibilities’, BJP national spokesperson Shehzad Poonawalla said that Congress in blaming the ‘janta’ (public) instead of introspecting.\nBihar election results 2025 live: JD(U) MLC condemns ‘whatever happened to Rohini’\nBihar election results 2025 live: On RJD leader Rohini Acharya's decision to quit politics and disown her family, JD(U) MLC Sribhagwan Singh Kushwaha said, \"...\nWhat can I say about the Lalu family?...\nWhy would someone with values raise a slipper on their sister?...\nI condemn whatever happened to Rohini...\"\nBihar election results 2025 live: BJP MP Manoj Tiwari reacts to Rohini Acharya leaving politics\nBihar election results 2025 live: BJP MP Manoj Tiwari on Sunday said that the apparent rift within the family reflects the \"mentality\" of a regime that, according to him, allowed \"jungle raj\" to flourish in Bihar for years.\nWhile taking a swipe at the RJD leadership, Tiwari said that those who aspired to run the entire state of Bihar were now unable to manage their own families.\nBihar election results 2025 live: BJP Bihar chief reacts after Rohini Acharya ‘quits’ politics\nBihar election results 2025 live: BJP Bihar chief Dilip Jaiswal expressed his concern over the situation, stating that the Lalu Yadav family \"should not be broken up like this\" after the assembly elections.\nJaiswal, while urging the intervention of Lalu Yadav and Rabri Devi, also backed Acharya, saying that it is inappropriate to see someone who once donated her kidney to Lalu Yadav being treated poorly.\nBihar election results 2025 live: Rohini Acharya's fresh allegations after quitting politics, disowning family\nBihar election results 2025 live: A day after quitting politics and her father's party Rashtriya Janata Dal, Rohini Acharya has laid out fresh allegations which led to her abrupt resignation from the party.\nTaking to X on Sunday, the RJD candidate from the Saran Lok Sabha seat shared that she had “filthy abuses, slippers' hurled at her.\nBihar election results 2025 live: Priyanka Chaturvedi's message to Nitish Kumar, NDA\nBihar election results 2025 live: Shiv Sena (Uddhav Balasaheb Thackeray) leader Priyanka Chaturvedi congratulated Nitish Kumar for overcoming anti-incumbency and winning a decisive mandate, while also urging the National Democratic Alliance (NDA), which secured a two-thirds majority in the Bihar assembly elections, to honour its promises to the people and not \"back away like in Maharashtra.\"\nBihar election results 2025 live: Shashi Tharoor reacts to Rohini Acharya's ‘quitting politics’ decision\nBihar election results 2025 live: Congress MP Shashi Tharoor said that there should be introspection in the aftermath of the elections when asked to comment on Rohini Acharya's decision to ‘quit’ politics and ‘disown’ her family.\nSpeaking to ANI, he said, \"I really don't want to comment on that.\nMy reasons are very simple - I have not been a campaigner in Bihar.\nI have not been there, I have not seen the ground reality...All I can say is, in the aftermath of an election, there should be introspection.\nEveryone should figure out what happened, what went wrong, what the issues were and when that happens, some conclusions may follow.\"\nBihar election results 2025 live: Jan Suraaj admits ‘difficult to defeat ruling parties’\nAfter Jan Suraaj's disappointing performance in the Bihar elections, spokesperson Pavan Verna said that while the party's message was correct, years of misery led the people of Bihar to vote for the ruling NDA alliance.\n“The ruling parties have the key to the treasury, while others can only make promises,” he said, claiming that direct benefit transfer was used to influence people's decisions in the election.\nBihar election results 2025 live: Who are Sanjay Yadav and Rameez, who ‘told’ Rohini Acharya to quit?\nBihar election results 2025 live: Rohini Acharya, Rashtriya Janata Dal (RJD) patriarch Lalu Prasad Yadav's daughter, named two people - Sanjay Yadav and Rameez - in the social media post, announcing her decision.\nNotably, Yadav is the Rajya Sabha MP from RJD and reportedly one of the most trusted aides of Tejashwi Yadav.\nMeanwhile, Rameez is said to be Tejashwi’s old friend who hails from a political family in neighbouring Uttar Pradesh.\nBihar election results 2025 live: Jan Suraaj's Pavan Varma attacks Congress\nBihar election results 2025 live: Jan Suraaj spokesperson Pavan Varma claimed that the Congress has now become virtually non-existent in Bihar, and its on-the-ground organisation has almost collapsed in the state after the assembly election results.\nHe hit out against the Congress' \"fantasy-driven\" politics, claiming that the party lacks the organisational strength required for success.\nBihar election results 2025 live: Bihar rejected 'exploitative' parties, says Rajeev Chandrasekhar\nBihar election results 2025 live: BJP Kerala chief Rajeev Chandrasekhar hailed the National Democratic Alliance's (NDA) victory in the Bihar assembly elections, stating that the results clearly show the people's support for \"good governance, corruption-free governance, and development,\" while rejecting what he called \"exploitative\" parties such as the Rashtriya Janata Dal (RJD) and the Congress.\nShe also alleged that she was “disgraced, abused, and even hit”.\nBihar election results 2025 live: Jan Suraaj claims ₹14,000 from World Bank diverted for polls\nBihar election results 2025 live: Jan Suraaj spokesperson Pavan Verma levelled serious allegations that funds from the World Bank meant for some other project were diverted for the Bihar assembly elections by the central government and distributed to women voters in the state.\n\"An hour before the moral code of conduct for the polls, ₹14,000 crores were taken out and distributed to 1.25 crore women in the state,\" he alleged.\nBihar election results 2025 live: Former union minister RK Singh resigns from BJP\nBihar election results 2025 live: Former union minister RK Singh on Sunday said that there is \"no use\" in staying in a party which tolerates individuals and fields candidates with a criminal background after his resignation from the BJP.\nNotably, he was suspended due to \"anti-party\" activities just a day after the National Democratic Alliance (NDA) secured a massive victory in the Bihar assembly elections.\nShe said, “I don't have a family.\nYou should go and ask Tejashwi Yadav, Sanjay Yadav, and Rameez.\nThey are the ones who threw me out of the family.\"\nBihar Assembly Election Result 2025 Highlights: Lok Janshakti Party (Ram Vilas) chief Chirag Paswan met Bihar Chief Minister Nitish Kumar in Patna today, days after the declaration of the Bihar Assembly election results.\nPaswan extended his heartfelt congratulations and best wishes to the Chief Minister on the NDA's resounding majority in the state.\nChirag Paswan, who is one of the prominent faces of the NDA's Bihar campaign, described his meeting with the Chief Minister as \"cordial and constructive.\" He said on X that the people of Bihar have given a decisive mandate in favour of the NDA, reflecting their trust in the coalition's leadership and development-oriented politics.\nThe BJP-led NDA is on track for a landslide victory in the 2025 Bihar Assembly elections, crossing the crucial majority mark with 204 seats in the 243-member Assembly.\nThis puts the Opposition Mahagathbandhan far behind, leading in only 32 seats, and leaving the Opposition reeling.\nA look at the Bihar assembly elections results:\nThe NDA registered a historic landslide victory in the 2025 Bihar Elections, winning 202 of the 243 seats in the state; meanwhile, the Mahagathbandhan could only secure 35 seats.\nNDA secured a three-fourths majority in the 243-member House.\nThis is the second time the NDA has crossed the 200 mark in the assembly polls.\nIn the 2010 polls, it had won 206 seats.\nIn the NDA, the Bharatiya Janata Party (BJP) won 89 seats, Janata Dal (United) won 85, Lok Janshakti Party (Ram Vilas) (LJPRV) won 19, Hindustani Awam Morcha (Secular) (HAMS) won five, and Rashtriya Lok Morcha won four seats.\nThe Rashtriya Janata Dal (RJD) won 25 seats, the Indian National Congress 6, Communist Party of India (Marxist-Leninist) (Liberation) - CPI(ML)(L) - two, Indian Inclusive Party (IIP) - one, and Communist Party of India (Marxist) - CPI(M) - one seat.\nAll India Majlis-E-Ittehadul Muslimeen (AIMIM) won five seats, and Bahujan Samaj Party (BSP) got one seat.\nBihar Election 2025 Winners & Losers: Check Complete List\nThe blog has ended.\nThe debacle of Prashant Kishor's Jan Suraaj party in the Bihar assembly elections has put the spotlight on the phenomenon of several such political 'startups' sprouting in the crowded political battleground but very few becoming 'unicorns'.\n(PTI)\nLok Janshakti Party (Ram Vilas) chief Chirag Paswan on Sunday refrained from commenting on Rashtriya Janata Dal (RJD) leader Rohini Acharya's decision to \"quit politics\" and distance herself from her family, while expressing empathy for her family's situation, drawing on his own experiences with personal crises, urged that the dispute be resolved at the earliest.\nSpeaking to ANI on RJD leader Rohini Acharya's announcement that she is quitting politics, Paswan said he understood the emotional strain such moments create.\nOn the Bihar Assembly election result, Union Minister Jitendra Singh says, \"BJP is always ready for any election.\nWe never have any specific target.\nThis is a natural part of our work process.\nIf you wake up our party workers from sleep, he raises his flag and shouts 'BJP Zindabad'.\"\nOn the Nowgam police station blast incident, he says, \"The relevant agencies are investigating this matter.\nAuthorised people will provide you with the reason behind this.\"\nOn NDA's landslide victory in Bihar elections, BJP MP Sanjay Jaiswal says, \"Whenever Rahul Gandhi speaks, it only benefits the BJP.\nThe issue of vote theft that they were raising was not there in Bihar at all.\nWe have provided schemes to support the poor.\nThis is our historic victory...\"\nCPI(M) leaders on Saturday alleged that their Kamalpur sub-divisional office in Tripura's Dhalai district was set on fire and two more party offices were vandalised by BJP supporters during celebrations over the party's massive victory in Bihar Assembly elections.\nHowever, there was no casualty or injury in the attacks.\n\"Soon after winning the Bihar Assembly elections, hundreds of BJP leaders and supporters gathered at Manikbhander to celebrate the party's victory.\nSuddenly, a group of party supporters torched the CPI(M) sub-divisional party office at Manikbhander shortly after 11.30.\nTables, furniture and party flags were gutted,\" party's Dhalai district secretary Anjan Das told reporters.\n(PTI)\nOn NDA's landslide victory in Bihar Elections, PM Narendra Modi says, \"My brothers and sisters living in Surat were closely monitoring this election.\nThe people of Bihar don't need to be taught politics.\nThey have the power to teach politics to the rest of the world.\"\nLJP (Ram Vilas) chief and Union Minister Chirag Paswan says, “On the question of the CM face, my party’s position is - as the Union Home Minister has also said and as the Constitution dictates - the MLAs will elect their leader as the CM.\nAs far as I believe, CM Nitish Kumar will once again become the Chief Minister.”\nFormer Bihar Chief Minister and Rashtriya Janata Dal (RJD) patriarch Lalu Prasad Yadav's daughter, Rohini Acharya, on Saturdary said she has decided to \"quit\" politics and \"disowning\" her family a day after the party suffered a massive defeat in assembly polls, securing only 25 seats in the 243 member state assembly.\nTaking all the blame, Rohini hit out at Sanjay Yadav, who is the RJD MP and close aide of Tejashwi Yadav, and said, \"This is what Sanjay Yaday had asked me to do.\"\n\"I'm quitting politics and I'm disowning my family ...\nThis is what Sanjay Yadav and Rameez had asked me to do and I'm taking all the blame,\" Rohini Acharya said.\nOn NDA's landslide victory in Bihar Election 2025, NCP-SCP chief Sharad Pawar says, “...The headlines in the newspapers today say that they (NDA) gave ₹10,000 to women and that resulted in their victory.\nGiving ₹10,000 right before elections is a corruption of sorts.\nThis was done by the State Govt there.\nWe accept it...The same thing happened in Maharashtra before the elections.\nIn the name of 'Ladki Bahin Yojana', money was disbursed (to women)…”\nCPI(M) Kerala state secretary M V Govindan on Saturday alleged that the Congress could not cohesively hold the broad secular alliance against the BJP in Bihar where the opposition suffered a rout in the Assembly elections.\n(PTI)\nNCP (SP) president Sharad Pawar on Saturday said the entrepreneurship scheme for women played a role in the victory of the NDA in the Bihar elections, even as he wondered how the Election Commission allowed distribution of funds during the poll process.\n\"The outcome of the Bihar polls was not different from what was predicted by (Chief Minister) Nitish Kumar.\nWomen took the election into their hands.\nI had earlier felt that a scheme under which ₹10,000 is deposited in bank accounts of women had generated a favourable effect (for NDA)\", Pawar told reporters in Baramati.\n(ANI)\nJan Suraaj president Uday Singh says, \"Congratulations to the NDA for a thumping majority.\nBut this is a mandate that has been bought.\nAfter 21st June, the Govt used ₹40,000 Crores from the Govt treasury to get this mandate.\nThis will affect Bihar's economy.\nIn the time to come, people will see that they will not have money for education, health or infrastructure.\nThey have also distributed ₹14,000 Crores from a loan they took from the World Bank.\nThat is the reason they got a thumping majority.\nAs far as Jan Suraaj is concerned, voters of Jan Suraaj got scared at the end.\nI think fearing RJD's return to power, they decided in the last few days that it would be safer for them to vote for NDA.\nThe mistake we made is that we failed in instilling confidence among the people that even if Muslims are not openly being seen with us, there could be an alternate system in Bihar.\nWe will be mindful of this mistake and in the time to come, work will be done on this.\"\nA day after the Bihar Election Results, JD(U) leader Shyam Rajak said on Saturday, “No one other than Nitish Kumar will take oath.\nThe Chief Minister will decide the date of the oath-taking ceremony.”\nAfter meeting CM Nitish Kumar, JD(U) leader Shyam Rajak said, \"The entire NDA is united.\nElections were contested under the leadership of Nitish Kumar.\nHe is our leader and he will be our next CM as well...\"\nBihar BJP chief Dilip Jaiswal said, “For a year, PM Modi held several programs in Bihar.\nHe gave special package of lakhs and crores of rupees for the development of Bihar...Lakhs of people used to come to his rallies.”\n“PM Modi's popularity was clearly seen in Bihar.\nNitish Kumar walked with PM Modi and worked for the development of Bihar.\nSo, PM Modi's guarantee of development and the trust of people of Bihar earned by Nitish Kumar made it clear 5-6 months ago that NDA will form the Govt with a thumping majority,” Jaiswal said.\nHe added, \"We organised an NDA workers' convention in January-February 2025.\nAll NDA allies went to the people as the 5 Pandavas...I would like to thank Union HM Amit Shah.\nI admire him for his strategies.\nWe brought his strategies to the ground...\"\nRahul Gandhi posted on X: \"I express my heartfelt gratitude to those millions of voters in Bihar who expressed their trust in the Mahagathbandhan.\nThis result in Bihar is truly surprising.\nWe could not achieve victory in an election that was not fair from the very beginning.\nThis fight is for the protection of the Constitution and democracy.\nThe Congress Party and the INDIA alliance will deeply review this result and make their efforts to save democracy even more effective.\"\nOn NDA's landslide victory in Bihar Elections, Maharashtra Dy CM Eknath Shinde said, \"People have rejected jungleraj and accepted development by showing faith in PM Narendra Modi...\nRahul Gandhi went there to catch fish.\nTo all those alleging vote chori, I would only say that people have given a befitting reply...\nWomen and youth have voted in large numbers, which is why the NDA has secured this landslide victory...\"\nBihar Election Result LIVE: \"I express my heartfelt gratitude to those millions of voters in Bihar who expressed their trust in the Mahagathbandhan.\nThe Congress Party and the INDIA alliance will deeply review this result and make their efforts to save democracy even more effective,\" said Rahul Gandhi.\nBihar Election Result LIVE: Congress president Mallikarjun Kharge responded to the Bihar election outcome with a message of resolve, stressing that the party respects the people’s mandate but remains committed to challenging what he described as forces “weakening democracy by misusing constitutional institutions.”\nIn a statement posted on X, Kharge said the Congress would undertake a detailed review of the results before presenting a comprehensive assessment of why the Grand Alliance fell short.\nHe expressed “deep gratitude” to voters who supported the coalition and offered reassurance to party workers across the state.\n“There is no need for you to feel discouraged,” he wrote.\n“You are our pride, honour and glory.\nYour hard work is our strength.”\nKharge said the Congress would “leave no stone unturned” in raising public awareness in the months ahead, reaffirming that the party’s struggle to protect the Constitution and democracy will continue on the ground, among the people.\nCalling the battle a long one, he emphasised that the Congress will pursue it “with complete dedication, courage, and truth.”\nBihar Election Result LIVE: Osama Shahab, son of the late gangster-turned-politician Mohammad Shahabuddin, has won Bihar’s Raghunathpur seat, defeating JD(U) candidate Vikas Kumar Singh by 9,248 votes.\nHis candidacy drew strong criticism from NDA leaders, who claimed the RJD’s decision to field him signalled a “return of jungle raj.”\nBihar Election Result LIVE: Congress leader Jairam Ramesh launched a sharp attack on the NDA after its sweeping victory in the Bihar Assembly elections, alleging large-scale electoral manipulation.\nIn a post on X, he said the results “reflect vote chori on a gigantic scale – masterminded by the PM, the HM, and the Election Commission.”\nRamesh added that the Congress will continue its fight “with even greater strength” to “protect the Constitution and save our democracy,” signalling the party’s intent to escalate its criticism despite the decisive mandate for the NDA.\nBihar Election Result LIVE: The Indian National Congress suffered a major setback in the 2025 Bihar Assembly elections, winning just three of the 61 seats it contested.\nAccording to ECI data, the party secured victories in Forbesganj, Kishanganj and Manihari.\nCongress, however, remains in the race in a few pockets, currently leading in Valmiki Nagar, Chanpatia and Araria — but the overall outcome marks one of its weakest performances in the state in recent years.\nBihar Election Result LIVE: Here's latest ECI trends on Bihar Election at 8.15 pm\nBharatiya Janata Party - BJP wins 78 seats, leading in 11\nJanata Dal (United) - JD(U) has won 64 seats, leads in 21\nRashtriya Janata Dal - RJD has won 20 seats, leading in 5\nLok Janshakti Party (Ram Vilas) - LJPRV has won 15 seats, leading in 4\nIndian National Congress - INC has won 3 seats, and are leading in 3\nAll India Majlis-E-Ittehadul Muslimeen - AIMIM has won 5 seats\nHindustani Awam Morcha (Secular) - HAMS has won 4 seats, leading in 1\nBihar Election Result LIVE: \"Ganga flows through Bihar and reaches Bengal.\nBihar has also paved the way for the BJP's victory in Bengal.\nI also congratulate the brothers and sisters of Bengal.\nNow, together with you, the BJP will uproot jungle raj from West Bengal as well,\" said PM Modi.\nBihar Election Result LIVE: Prime Minister Narendra Modi launched a strong attack on the Indian National Congress, accusing it of relying entirely on “negative politics.”\nHe said that Congress leaders repeatedly lash out — calling him “Chowkidar Chor,” attacking institutions and even the Election Commission of India — and lack any positive vision for the country.\nModi described the party as a “Muslim League manuwadi Congress,” claiming its agenda is driven by appeasement.\nWithout naming Rahul Gandhi directly, he referred to him as “naamdaar” and warned that the Congress is heading “on a path of destruction.” He also predicted the party might split soon, adding that it drags down alliance partners who join it.\nBihar Election Result LIVE: PM Modi waves gamcha at BJP headquarters to celebrate NDA’s landslide victory\nBihar Election Result LIVE: \"When I used to speak about Jungle Raj and Katta Sarkar, the RJD party raised no objections.\nHowever, it unsettled the Congress.\nToday, I want to reiterate that Katta Sarkar will never return to Bihar,\" said PM Modi.\nBihar Election Result LIVE: \"After 2010, Bihar has delivered its strongest mandate to the NDA.\nI wholeheartedly thank the people of Bihar for their support on behalf of all the parties within the NDA,\" said PM Modi.\nBihar Election Result LIVE: \"Today, Bihar is among those states in the country with the highest number of young people, and these include youth from every religion and every caste.\nTheir desires, their aspirations, and their dreams have shattered the old, communal MY Formula of Jungle Raj.\nToday, I especially congratulate the youth of Bihar,\" said PM Modi.\nBihar Election Result LIVE: Listen to PM Modi's complete speech here\nBihar Election Result LIVE: PM Modi hailed the “Mahila aur Youth” formula in his first speech after the NDA’s victory in Bihar.\nBihar Election Result LIVE: Hum to Janta Janardhan ka dil chura kar baithe hue hain, says PM Modi, adds, “aaj Majhane ki kheer banane ki byabasta kar diya\"\nBihar Election Result LIVE: PM Modi Modi begins speech at BJP Delhi headquarters with Bharat Mata ki Jai\nBihar Election Result LIVE: AIMIM made a sharp impact in the Bihar Assembly elections, winning four seats — Jokihat, Bahadurganj, Kochadhaman and Amour — and leading in one more.\nThe strong performance in the Seemanchal region highlights the party’s growing local influence and its ability to carve out space amid larger alliances.\nBihar Election Result LIVE: Celebrated folk singer Maithili Thakur has made a sweeping entry into politics — and history.\nAt just 25, she has won the Alinagar assembly seat in Bihar on a ticket from the Bharatiya Janata Party (BJP), becoming the youngest member of the Bihar Legislative Assembly.\nBihar Election Result LIVE: JP Nadda says ye Tsunami hain on Bihar Assembly election result.\nThe Union Minister said this was in the battle of Jungle Raj versus development, people have vooted for the latter.\n\"This tsunami has made it clear that whether it is the people of Bihar or the people of the country, everyone has unwavering faith in the esteemed Prime Minister ji, and he has put his stamp on the politics of development to take the state forward,\" said JP Nadda.\nBihar Election Result LIVE: JP Nadda took the stage at BP headquarters in Delhi to celebrate NDA's win in Bohar Assembly Elections.\nThe Union Minister thanked PM Modi and and Amit Shah for the win.\nBihar Election Result LIVE: Prime Minister Narendra Modi arrives at Delhi.\n‘Are Modi Modi’ chants fill the air.\nBihar Election Result LIVE: After NDA's thumping victory in Bihar assembly elections, Nitish Kumar is set to become the chief minister for the 10th time.\nKumar expressed gratitude to voters and said that Bihar will progress even further and will be included in the category of the most developed states.\nTaking aim at the Tejashwi Yadav–Rahul Gandhi-led Mahagathbandhan, he blamed its “arrogance” for the alliance’s collapse.\nPaswan added that the strong mandate reflects voters’ faith in the NDA’s unity and the impact of the “double-engine government” led by Prime Minister Modi at the Centre and Nitish Kumar in the state.\nBihar Election Result LIVE: Union Home Minister Amit Shah arrived at the BJP headquarters to cheering party workers as early trends pointed to a historic NDA victory in Bihar.\nBJP national president JP Nadda soon joined him, acknowledging supporters as the alliance surged ahead decisively in the polls.\nThe party headquarters buzzed with celebrations as leaders hailed the mandate.\nBihar Election Result LIVE: Bihar Deputy CM Samrat Chaudhary wins from Tarapur by a margin of 45843 votes.\nHe also expressed gratitude to Prime Minister Narendra Modi and alliance partners Chirag Paswan, Jitan Ram Manjhi, and Upendra Kushwaha for their united effort.\nKumar said the strong mandate will help push Bihar toward faster growth and its goal of joining India’s most developed states.\nBihar Election Result LIVE: Mahagathbandhan’s Deputy CM face Mukesh Sahni warned the NDA to deliver on its promises, especially the pending ₹1.9 lakh payment, saying voters could sideline them next.\nHe claimed the MGB’s base vote stayed intact but said a major swing of women voters towards Nitish Kumar drove the NDA’s sweeping mandate.\nBihar Election Result LIVE: Tejashwi Yadav is on track to win the Raghopur seat for the third consecutive time in the 2025 Bihar Assembly elections.\nWith 29 rounds of counting completed and one round remaining, the former Deputy CM has secured 1,16,467 votes, leading BJP's Satish Kumar by a margin of 13,880 votes.\nCatch all the live action on Assembly Election Results 2025, exclusive coverage from the streets of Bihar, minute- by-minute trend and tally analysis, and Latest News Updates on Mint.\nDownload The Mint News App to get Daily Market Updates.\nCheck latest updates on Bihar Chunav.\nBusiness NewsElectionsAssembly ElectionsBihar election results 2025 Highlights: Chirag Paswan meets Nitish Kumar—who will be the next Chief Minister?\nBihar election 2025: Modi's alliance wins by large margin\nNovember 15, 2025India's state of Bihar is one of the most populous in the country and has a hefty influence on the political landscape.\nThe election was seen as a barometer of support for Modi's BJP governing party and its allies.\nIndian Prime Minister Narendra Modi's party and its main regional ally have scored a landslide victory in elections in the eastern state of Bihar, according to results on Friday from the Election Commission of India.\nThe state election was closely watched because it offers an insight into the level of support for the Indian leader and his party.\nThere are 243 seats in the Bihar assembly, with 122 needed for a majority.\nModi's alliance, the National\nDemocratic Alliance, or NDA, went far beyond that, gaining 202 seats, with his Bharatiya Janata Party (BJP) alone accounting for 89 of these.\nThe election took place against the background of voter concern about unemployment, law and order, and alleged irregularities in the revision of electoral rolls.\nThe Bihar state election was held in two phases on November 6 and November 11 and witnessed a historic turnout of 66.91%, according to the Election Commission of India.\nThat was the highest voter turnout recorded in the state since 1951, with more women voting than men.\nA total of 74 million were eligible to vote.\nBihar is one of the poorest states in India, and women form an important voting bloc since men migrate out to other states and metropolitan cities to look for work.\nUnemployment is a big issue, with parties contesting in the election having promised to create millions of jobs.\nIn September, Modi made a move to appeal to women voters, handing out cash transfers of 10,000 Indian rupees ($113) each to 7.5 million women as part of an employment program.\nThe state elections have also been marked by the opposition accusing Modi's party of manipulating electoral rolls.\nBihar, which has a population of some 131 million, has a big influence on national politics.\nNearly a quarter of its residents are between 18 to 29 years of age.\nWhich parties competed for the vote?\nThere were more than 10 political parties standing, but the main competition has been between two main alliances: the BJP-led alliance, with the Janata Dal (United), known as JDU, as its key regional partner, and the main opposition alliance, comprising the Indian National Congress partnered with some other regional parties.\nThere was also a third party in the fray, led by a political strategist turned politician, Prashant Kishor, a man credited with having propelled Modi to electoral victory in 2014.\nIn the last assembly polls in 2020, the BJP and its alliance secured a majority of seats to form a state government, with Chief Minister Nitish Kumar of the JDU at the helm.\nBihar sends 40 of the 543 lawmakers to the lower house in parliament.\nThe win in the state will strengthen Modi's coalition, which relies on parties like the JDU to form a government at the national level, analysts say.\nModi's party, the Bharatiya Janata Party (BJP), suffered a setback in the 2024 national election when the party wasn't able to win an outright majority.\nThe BJP secured the backing of other parties and formed a coalition government with Modi at the helm.\nBut the BJP was then able to recover support in regional polls.\nModi is keen to sustain that momentum, with the BJP headed to polls in three key states, Uttar Pradesh, West Bengal and Assam, in the next two years, before national elections in 2029.\n- After meeting CM Nitish Kumar, JD(U)'s Shrawon Kumar\n- On the Bihar Assembly Election results, Congress MP P Chidambaram\n- LJP (Ram Vilas) chief and Union Minister Chirag Paswan\nBihar Election Result 2025 Live: Bharatiya Janata Party (BJP) leader Guru Prakash Paswan on Saturday criticised the opposition following the NDA's historic victory in the Bihar elections, asserting that their strategy of caste-based politics has failed and casting doubt on their political survival.\nThe two were joined by AICC general secretary, organisation, K C Venugopal, party treasurer Ajay Maken and AICC Bihar in-charge Krishna Allavaru, PTI sources said.\n- Jan Suraaj president Uday Singh in Patna\nBihar Election Result 2025 Live: Several Bihar assembly seats were decided by razor-thin margins, with three victories by under 100 votes.\nThe closest contest was in Sandesh, where JD(U)âs Radha Charan Shah won by just 27 votes.\nOther narrow wins included Agiaon (95 votes), Ramgarh (30), Nabinagar (112), Dhaka (178) and Forbesganj (221), underscoring intensely tight contests across the state.\nBihar Election Result 2025 Live Updates: After meeting Chief Minister Nitish Kumar, Union Minister and LJP(RV) chief Chirag Paswan said he had called on the CM to congratulate him on the NDAâs âhistoric victoryâ under his leadership.\nPaswan said an LJP(RV) delegation met Kumar to extend best wishes, adding that he was âdelightedâ the CM acknowledged the contribution of every alliance partner.\nHe noted that Kumar had supported the LJP(RV) candidate when he went to vote, while Paswan himself backed the JD(U) candidate in Alauli, saying this mutual support showed that âthose trying to mislead people about JD(U) and LJP(RV) were only creating a false narrative.â\nBihar Election Result 2025 Live Updates: Union Minister Gajendra Singh Shekhawat on Saturday applauded the victory of the National Democratic Alliance (NDA) in the Bihar Assembly Election 2025.\n\"BJP and all alliance partners in the NDA displayed unity.\nThe main issue in the Bihar elections was 'jungle raj' vs 'vikasvaad',\" he said.\nBihar Election Result 2025 Live Updates: Union Minister Chirag Paswan lambasted the opposition Mahagathbandhan for constantly finding fault with issues related to EVMs and blaming officials, and said that they would achieve \"something better\" if they spent time on their own assessment.\nBihar Election 2025 Result Live Updates: Congress MP Jairam Ramesh on Friday blamed \"vote chori\" for Mahagathbandhan's defeat in the Bihar Assembly election, calling Prime Minister Narendra Modi, Union Home Minister Amit Shah and the Election Commission \"masterminds\" behind it.\nThe National Democratic Alliance (NDA) delivered a commanding victory in the Bihar Assembly elections, with 28 sitting ministers securing wins in their respective constituencies.\nOne minister, however, fell short, marking the alliance's only notable setback in an otherwise sweeping mandate.\nKarnataka Minister Priyank Kharge has called the Bihar Assembly Election result \"extremely surprising\", adding that the verdict is \"not acceptable.\" Coming on the NDA landslide victory in the Bihar Election 2025, Kharge said to the media, \"It is extremely surprising and is not something we had expected.\nSince the verdict is out, let us see what happened and what the reasons are for it.\"\n- Mallikarjun Kharge accepts people's mandate in Bihar\nThe BJP-led NDA bagged 183 seats in Bihar Assembly election, giving a clean sweep to Mahagathbandhan\nDY CM and BJP's winning candidate from Lakhisarai, Vijay Kumar Sinha told ANI, \"I thank the people of Lakhisarai, Bihar.\nYou have enhanced the honour of Biharis...The people have expressed confidence in Prime Minister Modi and Nitish Kumar...\nTejashwi Yadav had said to write it down that Vijay Kumar Sinha will not win, but today the people of Lakhisarai have not only responded to him, but also given him a befitting reply...\"\nThe Indian National Congress managed to win six of 61 seats it contested in Bihar elections\nOwaisi, who extensively campaigned in Bihar in support of his party candidates, also said non-NDA parties should try to address their shortcomings instead of assuming voters would automatically favour them\n- BJP MP Bansuri Swaraj on NDA's victory in Bihar\n\"Ganga flows through Bihar and reaches Bengal.\nWhat has added an unexpected twist to the contest is Chirag Paswanâs Lok Janshakti Party (Ram Vilas), which has surged ahead as one of the most striking performers in the ruling coalitionâs sweeping march.\nPM Modi accepts greetings of party workers by waving 'gamchha' as BJP chief J P Nadda welcomes him at party headquarters\nDelhi: Prime Minister Narendra Modi greets party workers and leaders as he arrives at the party headquarters The National Democratic Alliance (NDA) is set to secure a historic win in Bihar\nTejashwi Yadav clinches Raghopur seat after a tense, nail-biting contest in one of RJDâs strongest bastions\nLalu Yadav's elder son Tej Pratap Yadav lost Mahua seat to LJPRV's Sanjay Kumar Singh\nDefence Minister Rajnath Singh arrives at party headquarters in Delhi after NDA's landslide victory in the Assembly election\nDelhi: Union Home Minister Amit Shah greets party workers and leaders as he arrives at the party headquarters The National Democratic Alliance (NDA) is set to secure a historic win in Bihar\nIn the Bihar Legislative Assembly Elections-2025, the people of the state have expressed their confidence in our government by giving us a massive majority.\nFor this, I bow to all the esteemed voters of the state, and express my heartfelt gratitude and thanks.\nI express my heartfelt gratitude and thanks to the Honorable Prime Minister Shri Narendra Modi Ji for the support received from him, while bowing to him.\nThe NDA alliance has achieved a massive majority in this election by demonstrating complete unity.\nFor this massive victory, thanks and gratitude are also due to all the partners of the NDA alliance - Shri Chirag Paswan Ji, Shri Jitan Ram Manjhi Ji, and Shri Upendra Kushwaha Ji.\nUnion Minister Dharmendra Pradhan, CM Rekha Gupta, MP Manoj Tiwari and other leaders arrive at the BJP headquarters in Delhi as celebrations continue following the NDAâs sweeping victory\nThe Delhi Traffic Police on Friday issued an advisory announcing restrictions, diversions and parking curbs in central Delhi between 3 pm and 9 pm in view of VVIP movement\nBihar Election Results 2025: The tide in Bihar on Friday seems to be unmistakably turning in favour of the National Democratic Alliance, powered primarily by the Bharatiya Janata Party and the Janata Dal (United).\nHeartfelt salutations to the people of Bihar.\nJai Siya Ram The historic public support received by the National Democratic Alliance (NDA) in Bihar is a seal of trust from the people in the development-oriented and public welfare policies of the double-engine government under the guidance of the esteemed Prime Minister Shri Narendra Modi ji and the leadership of Chief Minister Shri Nitish Kumar ji.\nThis resounding majority is proof that our brothers and sisters in Bihar have completely rejected the jungle raj and corruption of the Mahagathbandhan and embraced the dimensions of good governance, stability, and development of the NDA.\nThis unprecedented mandate will give concrete form to our resolve of 'Developed Bihar â Developed India'.\nOn this historic victory, I extend hearty congratulations to all members of the NDA parties and the dedicated and hardworking workers of @BJP4Bihar, and I salute the residents of Bihar\n- PM Narendra Modi on Bihar Election results\n\"I extend my congratulations to the NDA parties in Bihar and to the people of Bihar who have once again elected a good government.\nIt is now time for all the NDA parties in the state to work just as hard to run the government as they worked during the campaign.\nAnd we are absolutely ready for it.\"\nThis is the victory of every Bihari who believes in âDeveloped Biharâ.\nNo matter in what guise those who practice jungle raj and appeasement politics come, they will not get the opportunity to loot.\nThe public now gives its mandate solely and exclusively on the basis of âPolitics of performanceâ.\nI congratulate Narendra Modi ji, Shri Nitish Kumar ji, and all the leaders and workers of the NDA.\nAt the same time, I salute all the workers of @BJP4Bihar from the booth level to the state level who have brought this result to fruition through their tireless hard work.\nI assure the people of Bihar and especially our mothers and sisters that with the hope and trust with which you have given this mandate to the NDA, under the leadership of Modi ji, the NDA government will fulfill it with even greater dedication.\nEvery single vote of the people of Bihar is a symbol of faith in the Modi government's policy against infiltrators who play with India's security and resources, and their sympathizers.\nThe public has given a befitting reply to those who protect infiltrators for the sake of vote banks.\nThe people of Bihar have conveyed the mood of the entire country that the purification of the voter list is mandatory and there is no place for politics against it.\nThat is why, under the leadership of Rahul Gandhi, the Congress has today reached the last rung in Bihar.\n- BJP MP Ravi Kishan on NDA heading towards a landslide victory in Bihar\nTejashwi Prasad Yadav has taken the lead in Biharâs high-stakes Raghopur constituency as counting reaches the 19th round, delivering a dramatic turn in one of the stateâs most closely watched battles.\nThe RJD leader now holds 72,932 votes, edging past BJPâs Satish Kumar, who has 71,746 votes, by a margin of 1,186.\nThe contest has seen intense swings throughout the day, with Tejashwi falling behind, briefly regaining ground, slipping again, and now surging ahead as the race grows tighter\nThe Bihar verdict has turned out to be decisive.\nRJD, once the undisputed decider of the state's fate for a long time, faltered and lost the plot badly with rivals NDA surging well ahead of the Mahagathbandhan.\nWhat began as a contest that could have tilted either way ended with the RJD unable to convert momentum into seats or a mandate for its leader, Tejashwi Yadav.\nJD(U)'s Ram Chandra Sada wins Alauli by 35,732 votes, defeating RJD candidate Rambriksh Sada, says EC\nBihar Election 2025 Result Live: According to the Election Commission of India (ECI), JD(U)âs Maheshwar Hazari has won the Kalyanpur Assembly seat in Bihar, defeating CPIM(L) Liberationâs Ranjeet Kumar Ram by a margin of 38,586 votes.\nBihar Election 2025 Result Live: The trends of the Bihar Assembly elections show a dominant performance by the BJP, which is now leading on 95 seats, closing in on the century mark.\nIn contrast, Congress has managed to lead on only a single seat, highlighting the partyâs disappointing show in the state.\nThe early results reflect a significant setback for the party in the state, highlighting the challenges it faces in regaining its foothold amid the strong showing of other alliances.\nBihar Election 2025 Result Live: As per the Election Commission of India (ECI) updates for Mokama in Bihar, after the final round of counting, JD(U)âs Anant Kumar Singh won with 91,416 votes, holding a margin of 28,206 over his nearest rival.\nRJDâs Veena Devi came second with 63,210 votes.\nCheck f\nBihar Election 2025 Result Live Updates: As per the Election Commission of India (ECI) updates for Tarapur, BJPâs Samrat Choudhary is leading with 74,435 votes, holding a margin of 25,376 votes.\nRashtriya Janata Dal's Arun Kumar is trailing with 49,059 votes.\nCommunist Party of India (Marxist-Leninist) (Liberation) Quyamuddin Ansari is trailing.\nBihar Election 2025 Result Live Updates: Samajwadi Party chief Akhilesh Yadav on Friday alleged that the \"game\" carried out through the Special Intensive Revision (SIR) of electoral rolls in Bihar will no longer be possible in other states.\nYadav's comments came as the BJP-led NDA appeared to be heading for an impressive victory in Bihar, even as the opposition Congress raised doubts over the integrity of the ongoing counting process.\nRJDâs Binod Mishra is trailing closely, while independent candidate Saifuddin Ahmed remains far behind, reflecting a solid lead for the BJP candidate in this constituency.\nRJDâs Shatrughan Yadav(Keshari Lal Yadav) is trailing closely, while independent candidate Rakhi Gupta remains far behind.\nRJDâs Samir Kumar Mahaseth is trailing closely, while AIMIMâs Rashid Khalil remains far behind.\nRJDâs Sandhya Rani is trailing closely, while Jan Suraaj Party candidate Vijay Kumar Kushwaha remains far behind, reflecting a strong lead for the BJP candidate in this constituency.\nThe partyâs impressive showing builds on its clean sweep in last yearâs Lok Sabha elections, where it won all six seats it had contested, highlighting its continued influence in the region.\nWithin the alliance, the BJP is ahead on 91 seats, JD(U) on 81, LJP(RV) on 21, HAM(S) on 5, and RLM on 4, reflecting a commanding position for the ruling coalition as it marches toward a decisive victory.\nBihar Election 2025 Result Live: As per the Election Commission of India (ECI) updates for Bodh Gaya in Bihar, after the 23rd round of counting, Lok Janshakti Party (Ram Vilas) candidate Shyamdeo Paswan is leading with 91,218 votes, holding a margin of 4,890 over his nearest rival.\nRJDâs Mukesh Kumar Raushan is trailing, while Tej Pratap Yadav of Janshakti Janta Dal remains further behind, along with AIMIMâs Amit Kumar.\nIndependent candidate Khurshid Firoz Ahmad is trailing with 22,825 votes, while CPI(ML)Lâs Birendra Prasad Gupta remains further behind at 11,203 votes.\nThe NDA is leading on 197 seats, with the BJP ahead on 89, JD(U) on 79, LJP(RV) on 21, HAMS on 4, and RLM on 4.\nThe Mahagathbandhan is leading on 40 seats, with the RJD ahead on 31, Congress on 4, CPI(ML)L on 4, and CPI(M) on 1, reflecting a strong early showing for the ruling alliance.\nBihar Election 2025 Result Live: As per the Election Commission of India (ECI) updates, the Raghopur Assembly seat in Bihar is witnessing a neck-and-neck contest.\nRJDâs Tejashwi Yadav has pulled slightly ahead of BJP candidate Satish Kumar, leading by 219 votes in the ongoing counting process, highlighting a closely fought battle in this constituency.\nIn the 2025 elections, early trends from the Election Commission of India (ECI) show the party leading on 35 seats.\nKey constituencies where the RJD is ahead include Sursand, Bisfi, Narpatganj, Raniganj, Mahishi, and Darbhanga Rural.\nCPI(ML) Liberation was ahead in 7 seats, while the CPI(M) was leading in 2.\nCPI(ML) Liberation candidates were leading in Daraunda, Paliganj, Arrah, Dumraon, Karakat, Arwal and Ghosi seats.\nCPI(M), on the other hand, was leading in Hayaghat and Bibhutipur seats.\nThe party is ahead in key constituencies including Kalyanpur, Warisnagar, Samastipur, Sarairanjan, and Hasanpur, reflecting a strong start for JD(U) in the current elections.\nThe party is ahead in Kochadhaman, Amour, and Baisi constituencies.\nIn 2020, the party contested 20 seats and won five.\nThe NDA has crossed the halfway mark of 122, while the Opposition's Mahagathbandhan is trailing behind as per the Election Commission of India.\nBihar Election 2025 Result Live: The Lok Janshakti Party, which had won only one seat in the 2020 Bihar Assembly elections, is on road for a big show under Chirag Paswanâs leadership.\nEarly EC trends show the party leading on 16 seats, including Sugauli (Rajesh Kumar alias Bablu Gupta), Govindganj (Raju Tiwari), Belsand (Amit Kumar), Bahadurganj (Mohammad Kalimuddin), and Kasba (Nitesh Kumar Singh), reflecting a notable surge in support for the LJP(RV) in this election.\nRJDâs Mohammad Shamsad Alam is trailing with 11,549 votes, while Jan Suraaj Partyâs Anil Prasad Sah remains further behind at 1,210 votes, reflecting a strong early lead for the BJP candidate in this constituency.\nSurendra Prasad holds an early lead in Valmiki Nagar, Abhishek Ranjan in Chanpatia, Washi Ahmad in Bettiah, Subodh Mandal in Phulparas, Manohar Prasad Singh in Manihari, and Amita Bhushan in Begusarai, reflecting the partyâs initial strong presence in these seats.\nRJDâs Tejashwi Prasad Yadav is trailing with 10,957 votes, while independent candidate Baliram Singh is further behind at 310 votes, reflecting early trends in this closely watched constituency.\nIndia Today and NDTV put the NDA ahead on 190 seats, while the Mahagathbandhan (MGB) trails with 50 seats on both networks, highlighting a commanding early lead for the ruling alliance.\nRJDâs Veena Devi is trailing with 15,174 votes, while Jan Suraaj Partyâs Priyadarshi Piyush remains further behind at 6,412 votes, reflecting a strong early lead for the JD(U) candidate.\nBJPâs Satish Kumar is trailing with 7,471 votes, reflecting early trends in this high-profile constituency.\nRJDâs Shatrughan Yadav, popularly known as Khesari Lal Yadav, is trailing at this stage, reflecting early trends in this closely watched seat.\nOther parties and independents are leading on 6 seats, reflecting a clear early advantage for the ruling alliance.\nBihar Election 2025 Result Live Updates: JD(U) has overtaken its ally BJP in early trends.\nBoth networks report the JD(U) leading with 75 seats, while the BJP holds 70, reflecting a close but favorable position for the party within the NDA alliance during the ongoing counting process.\nOther NDA allies also posted strong strike rates.\nMeanwhile, the Mahagathbandhan parties had contrasting result.\nThe Rashtriya Janata Dal (RJD) and the Congress suffered sharp setbacks.\nThe performance of Jan Suraaj was surprising as despite Prashant Kishor’s high-voltage statewide campaign, the party failed to open its account in Bihar Election 2025.\nStay tuned for LIVE updates on Bihar Election Result 2025.\nUnion Minister Chirag Paswan on Sunday rejected the claims made by Jan Suraaj spokesperson Pavan Varma that funds from the World Bank, intended for another project, were \"diverted\" by the central government for the Bihar Assembly elections and distributed to women voters in the state, as per ANI.\nSpeaking to reporters, Paswan questioned the origin of Varma's information and accused him of making \"empty claims.\"\n\"Where do they get this data from, this information from?...\nMaking empty claims - if you have any facts, present it and the Govt will respond,\" Paswan told reporters.\nLalu Prasad Yadav's daughter Rohini Acharya took to X and said, “Yesterday, a daughter, a sister, a married woman, a mother was humiliated, filthy abuses were hurled at her, a slipper was raised to hit her.\nI did not compromise on my self-respect, I did not surrender the truth, and solely because of this, I had to endure this insult…Yesterday, a daughter, out of compulsion, left behind her crying parents and sisters and came away; they tore me away from my maternal home...\nThey left me orphaned...”\nShiv Sena (Uddhav Balasaheb Thackeray) leader Priyanka Chaturvedi congratulated Bihar Chief Minister Nitish Kumar for overcoming anti-incumbency to secure a decisive mandate.\nShe also called on the National Democratic Alliance (NDA), which won a two-thirds majority in the Bihar Assembly elections, to deliver on its promises to the people instead of backing away like in Maharashtra.\nSpeaking to ANI on Saturday, Chaturvedi stated, \"Many promises have been made to the people of Bihar and the people have believed in all of them.\nNDA needs to stand up to those expectations now.\nThey cannot back away like they have in Maharashtra.\"\nPavan Verma, the Jan Suraaj spokesperson and a key architect of the party, alleged that the Modi government redirected World Bank funds, originally intended for another project, towards the Bihar Assembly elections and distributed the money to women voters in the state, according to ANI.\nNCP-SCP chief Sharad Pawar on Saturday claimed NDA of getting involved in \"corruption\" by distributing ₹10,000 under the Mukhyamantri Mahila Rojgar Yojana just prior to the Bihar Assembly election.\nSharad Pawar mentioned that the same technique was also used before the 2024 Maharashtra Assembly election under the name of the Ladki Bahin Yojana to influence women's votes.\nPM Modi said that the Congress does not have an explanation for its defeat in Bihar and blames EVMs or the SIR process, as per ANI.\n\"They say no one can save the Congress party; this is the state it has reached...\nThis is a matter of serious introspection for them.\nThey can't even explain the reasons for their defeat to their own colleagues.\nTherefore, they have taken the easy route.\nSometimes the EVM defeats them, sometimes the Election Commission defeats them, sometimes the voter list purification defeats them,\" he said.\nReeling from the Bihar election results, Congress and other opposition parties on Saturday questioned the Election Commission's role during the polls, attributing their poor performance to the \"hurried\" Special Intensive Revision (SIR) of electoral rolls, as per PTI.\nOn the other hand, the BJP asserted that the overwhelming mandate for the NDA reflected public approval of the SIR, claiming that voters have \"punished\" the opposition alliance for allegedly defaming the country and fostering divisions based on caste and religion.\nThe ruling party added that the verdict could pave the way for NDA victories in West Bengal and Tamil Nadu.\nTejashwi Yadav and his close aide RJD MP Sanjay Yadav have \"thrown\" her out of the family, Rashtriya Janata Dal (RJD) patriarch Lalu Prasad Yadav's daughter Rohini Acharya alleged on Saturday hours after announcing her decision to \"quit politics\" and \"disown\" her family, according to ANI.\nTejashwi's sister claimed that she was \"disgraced, abused, and even hit\" when she asked Sanjay Yadav for the party's defeat.\nPrime Minister Narendra Modi on Saturday stated that the people of Bihar have turned against the Congress, describing it as a “Muslim League-Maoist” alliance, and rejected the Opposition that propagated the “poison of casteism\", as per PTI.\nTaking a dig at Rahul Gandhi, he added that even Congress’ nationalist leaders who had served under former prime ministers Indira Gandhi and Rajiv Gandhi were disheartened by the conduct of the “namdar.”\nJan Suraaj Party president Uday Singh stated on Saturday confirmed that party founder Prashant Kishore will stay involved in politics and will remain dedicated to working for the development of Bihar.\nAs per ANI, Singh said, \"Certainly, he (Prashant Kishor) will continue to be there (in Bihar).\nWe didn't enter politics at the behest of JD(U); we won't leave at their behest either.\nWe can think of leaving only when we feel that a change has set in in Bihar.\"\nAs RJD chief Lalu Yadav’s daughter Rohini Acharya announced her decision to step away from politics, BJP MLA Sanjiv Chaurasiya said on Saturday that internal disputes within the former Bihar Chief Minister’s family are becoming visible and will need to be explained to the public.\n“Family feuds are beginning to surface, so now they'll have to answer for them,” Chaurasiya told ANI.\nJan Suraaj party spokesperson Pavan Verma said on Sunday that the issue of “Vote Chori” had become irrelevant after the Supreme Court ruled that the Aadhaar Card can serve as a valid voter identification document.\nWhile speaking to ANI, Verma said, \"We have not been against the SIR.\nIt is the Election Commission's responsibility to ensure the voter list is updated.\nAll we said was that there are 8 crore voters in Bihar, and if this exercise is started in June, it would leave very little time and could create chaos.\nIt could have started in February.\nThe Bihar election was total confusion and mismanagement because of the SIR, TNCC president K Selvaperunthagai claimed on Saturday.\nThe grand old party’s vote bank remained intact, he said and indicated that the scales tilted towards the NDA due to ₹10,000 given to each household.\nOur vote bank has remained intact.\nOur ally, the RJD’s vote share was reduced by only 0.3 per cent,\" Selvaperunthagai told reporters here.\nRead here\nIn a cryptic post on X, Rohini Acharya announced that she is quitting politics and disowning her family.\nShe claimed that is what Sanjay Yadav and Rameez had asked her to do.\nSpeaking about Lalu's daughter Rohini Acharya's decision to exit politics, BJP MP Rajiv Pratap Rudy said it is possible that “she is feeling some disappointment,” claiming that he thinks “that RJD is disintegrating, and the signs are not good,” reported ANI\nTwo candidates from Janata Dal (United) (JD(U)), and one candidate from the Bharatiya Janata Party (BJP) have the highest declared assets among the 243 winners, mentioned a report by ADR.\nIn the name of 'Ladki Bahin Yojana', money was disbursed (to women)...\" NCP-SCP chief Sharad Pawar said following the Bihar Election results\nSenior Congress leader Ajay Maken on Saturday said that party workers across Bihar have been alleging discrepancies in the election results and were demanding a probe.\nThe Congress leader further stated that the alliance partners in Mahagathbandhan agree that the results were unexpected and should be examined, reported ANI.\nJan Suraaj Founder Prashant Kishor to hold a press conference in Patna at 11 am tomorrow on Bihar Election 2025 and the party's next strategy.\nAfter Congress, Jan Suraaj Party State Unit Chief Manoj Bharti has also claimed malpractice in the Bihar election result.\n“The results were beyond our imagination.\nEver since they were announced, we have been discussing various aspects of what went wrong.\nOne possibility that can't be ruled out is malpractice during the election...\nAnother major reason we see is the distribution of ₹10,000 into women’s accounts right before the elections, which may have had the biggest impact on the results.”\nBihar BJP suspends party MLC Ashok Kumar Agarwal and Katihar Mayor Usha Agarwal for \"anti-party activities\".\nThe party has asked them to submit a reply within one week.\nCongress leaders KC Venugopal and Ajay Maken met Congress chief Mallikarjun Kharge today and said the results are “unbelievable.”\nVenugopal said, \"The result which has come from Bihar is unbelievable for all of us...\nOur alliance parties do not believe it...\nWe are collecting data and conducting a thorough analysis, and within 1 to 2 weeks, we will provide concrete proof...\nThe Election Commission is totally one-sided...\nThis process is questionable...\n\"\nAjay Maken said, \"There has been a question mark over the entire election process right from the beginning.\nWhen that is the case, results will be unexpected like this.\nThere was never a strike rate like this.\nEven Congress didn't have a strike rate like this in 1984, as is the case with the BJP in these elections.\nWe have spoken with our alliance partners.\nAll of them believe that these are unexpected results and these should be examined, data should be analysed.\nWe have been getting phone calls from workers across Bihar that there have been discrepancies and it should be investigated.\nOur people are collecting the data, we will see Form 17 C, voters list and then come to you with facts and data...\"\nAfter meeting CM Nitish Kumar, Union Minister and LJP(RV) chief Chirag Paswan says, \"I met the CM, congratulated him and extended him best wishes.\nNDA registered a historic victory under the leadership of Nitish Kumar.\nSo, a delegation of LJP(RV) met him and congratulated him.\nI am delighted that the CM appreciated the role of every alliance partner in the NDA.\nHe supported the LJP(RV) candidate when he went to vote.\nIn Alauli, where I vote, I supported JD(U) candidate.\nThis shows that those were misleading regarding JD(U) and LJP(RV) were just setting false narrative...\"\nDay after the NDA secured a massive victory in the Bihar Assembly election, the JD(U) started to begin the huddle at the CM residence in Patna.\nJD(U) National Working President and MP Sanjay Kumar Jha have arrived at Nitish Kumar's residence.\nLJP chief Chirag Paswan has attacked the Mahagathbandhan after its terrible performance in the Bihar Election 2025, saying they have constantly been finding faults after losing the polls.\nHe said, “Finding fault with every issue, blaming EVMs, and blaming officials.\nIf they spent as much time on their own assessment as they do on finding fault, then Congress and RJD would likely achieve something better.\nNo Bihari tolerates personal comments that go below the limits.\nThe 'Mahagathbandhan' has suffered losses due to this repeatedly.”\nAmid the political crossfire over the Bihar election results and claims of institutional bias, Samajwadi Party chief Akhilesh Yadav sharpened his attack on the ruling bloc, insisting that opposition concerns about the electoral process cannot be brushed aside\nYadav, taking aim at the government, said that in the \"race to compete with the Lucknow establishment,\" some political figures were attempting to \"rename institutions\" and project themselves as the architects of development while simultaneously “undermining democratic transparency.”\nWithout taking names, the SP chief alleged that those who \"failed to secure people's trust in the last Uttar Pradesh elections\" were already preparing narratives for future victories.\nAkhilesh Yadav said, \"Looks like someone's learned to rename things, competing with Lucknow's renaming spree!\nThey're calling the Election Commission 'Vikas' (Development) and claiming it's the reason for their impending win.\nThose who lost in UP's last election are now claiming they'll win next time, saying, 'We defeated them in '24, we'll remove them in '27 and form our own PDA government!'\"\n“Today, the Congress has become the Muslim League-Maoist Congress, that is, MMC.\nThe kind of negative politics that the party's leaders are engaged in has created the possibility of another major division in the Congress!” PM Modi tweeted this morning.\nOn NDA winning the Bihar elections, NCP-SCP MP Supriya Sule said that the allies will do an analysis of their defeat.\nShe said “Jo Jeeta Wohi Sikandar.\nI congratulate Nitish Kumar on their landslide victory.\nWe will do an analysis of our defeat.”\nOn winning from Narpatganj, BJP candidate Devanti Devi said, “Look, I want to express my gratitude to the people of Narpatganj.\nI will make every effort to complete all the remaining development works in the Narpatganj Assembly constituency.”\n“I also want to thank the party leadership, the state leadership, the central leadership, and especially my elder brother, Pradeep Kumar Singh ji for placing their trust in me.\nI want to thank every voter of the Narpatganj Assembly constituency, especially our women voters, and our workers who worked tirelessly for 15 days without proper sleep or food to help secure this victory for me.\nI want to express my heartfelt gratitude to all of them.”\nPM Modi, who repeatedly attacked the RJD over “jungle raj” during the campaign, thanked Bihar voters for the NDA’s sweeping win, saying the mandate reflects a new “MY formula” — Mahila and Youth.\nHe said:\n- “Jai Chhathi Maiya, yeh prachand jeet, atoot vishwas, Bihar ke logo ne bilkul garda uda diya hai.”\n- PM Modi said that the BJP and its allies work hard for the welfare of people and have stolen their hearts.\n- PM Narendra Modi called Congress \"Muslim League Maoist Congress (MMC).\n- The prime minister also took a jibe at Rahul Gandhi over his dip in a pond in Begusarai, saying that he practised to “drown himself and others” ahead of the results.\nCongress is a parasite that wants to make a comeback by swallowing the vote bank of its allies.”\n- He further assured the people that “Jungle Raaj” will never return to Bihar.\nWithin the Mahagathbandhan, the Rashtriya Janata Dal managed 25 seats.\nThe CPI(ML)(Liberation) won two, and both the Indian Inclusive Party (IIP) and the CPI(M) bagged one seat each.\nOutside the two main blocs, AIMIM made notable gains with five seats, while the Bahujan Samaj Party secured one.\nBusiness NewsElectionsBihar Election Result 2025 LIVE: Sharad Pawar credits ₹10k payout for NDA victory, says ‘corruption of sorts’"
    },
    {
      "cluster_id": 4,
      "article_count": 6,
      "sentences_kept": 316,
      "text": "Bihar Election 2025 Results: The National Democratic Alliance (NDA), which includes Nitish Kumar’s JD(U) and Bharatiya Janata Party (BJP), scripted a landslide victory by winning 202 seats in the 243-member assembly.\nThe Mahagathbandhan alliance led by the RJD won 35 seats.\nAmong the NDA, the BJP won 89 seats, emerging as the single largest party, followed by the JD(U) with 85 seats.\nThe Lok Janshakti Party (LJP-RV) secured 19 seats, while its two other allies won 9 seats.\nIn the Opposition camp, the RJD won 25 seats while the Congress won just six seats.\nWas this the NDA’s best performance or the RJD’s worst?\nThe NDA has secured bigger victories in the past, and the RJD has also delivered poorer performances in the past.\nThe JD-U vote share was 22.58 per cent, while the BJP bagged 16.5 per cent of the votes.\nThe RJD got 18.84 per cent votes in the 2010 assembly elections.\nThe party had fought on 75 seats.\nThe BJP and the JD (U) were part of the NDA.\nThe JD(U) had contested 141 seats, while the BJP fielded candidates on 102 seats.\nThe RJD and Lok Janshakti Party (LJP), then led by Ram Vilas Paswan, were part of the RJD-led opposition alliance.\nThe Congress, which contested 243 seats, won just 4 seats with 8.37 per cent vote share.\nThe RJD's performance in 2010 with 22 seats dealt a major blow to Lalu Prasad Yadav's political dominance in Bihar.\nThe Congress contested alone and remained marginal.\nNitish Kumar, however, won with a massive mandate for his party.\nIt was the first major verdict for Kumar's good governance and 'Sushasan Babu' image.\nBihar saw improvements in roads, law and order and women's empowerment in Nitish's previous tenure.\nThe result also marked the shifting away from the RJD rule, solidifying Nitish Kumar's reputation as the face of the Bihar governance model.\nWith the massive mandate, Nitish Kumar returned as CM for his second consecutive term and third term overall.\nClearly, in both 2010 and 2025, the BJP won almost 9 out of every 10 seats it contested – an extraordinarily high strike rate.\n- The NDA's consistent performance over the years illustrates the importance of strong party alliances in electoral success.\n- Understanding past election results can provide insights into future political strategies and voter behavior in Bihar.\nCatch all the live action on Assembly Election Results 2025, exclusive coverage from the streets of Bihar, minute- by-minute trend and tally analysis, and Latest News Updates on Mint.\nDownload The Mint News App to get Daily Market Updates.\nCheck latest updates on Bihar Chunav.\nBusiness NewsElectionsAssembly ElectionsBihar 2025: Was this BJP’s best or RJD’s worst?\nBihar elections 2025: Women candidates shine with 32 per cent success rate | Full List of winners\nBihar election women candidates: The party with the highest number of women winners was the BJP and JDU, which secured victory for ten women candidates each in the Bihar assembly elections 2025.\nWomen's political participation and victories in the Bihar Assembly Election 2025 became an important point of discussion this year.\nCompared with the previous election, women received more opportunities, and their overall performance also improved.\nPolitical parties gave greater priority to women during ticket distribution and as a result, the number of women in the Assembly increased.\nTheir success reflects not only their political capability but also the positive social and political changes taking place in Bihar.\nVictory for 29 out of 88 women candidates\nA total of 10 political parties fielded 88 women candidates in this election, a significant step forward compared with previous years.\nOut of these 88 contestants, 29 secured victory and entered the Assembly.\nThis reflects a winning share of about 32 per cent, which shows the growing influence of women in Bihar’s challenging political landscape.\nThe Bharatiya Janata Party recorded the highest number of victories with ten wins from twelve tickets.\nThe Janata Dal United matched this with ten wins from thirteen tickets.\nThree women candidates each won from the Rashtriya Janata Dal and the Lok Janshakti Party Ram Vilas.\nTwo candidates won from the Hindustani Awam Morcha and one candidate from the Rashtriya Lok Morcha.\nIn 2020, a total of 25 women were elected to the Assembly.\nIn 2025, this number increased to 29.\nThe rise may not appear very large, but it signals expanding opportunities for women in politics.\nIt also shows that political parties are now focusing on bringing women into positions of real power rather than treating them as symbolic figures.\nThe 2025 election was notable because several young, educated and socially active women candidates achieved significant victories.\nAlthough women’s representation is still below 10 per cent, it is clear that their influence on the political field continues to grow.\nComplete list of party-wise winning candidates in Bihar elections 2025\nOpt out of the sale or sharing of personal information\nWe won't sell or share your personal information to inform the ads you see.\nYou may still see interest-based ads if your information is sold or shared by other companies or was sold or shared previously.\nBihar Election Results 2025: EC team reaches Raj Bhavan to submit list of 243 newly elected Bihar MLAs\nBihar Election Results 2025: Chirag Paswan meets Nitish Kumar day after NDA's sweep; Kharge, Rahul discuss poll drubbingBre...\nBihar Election Results 2025: Chirag Paswan meets Nitish Kumar day after NDA's sweep; Kharge, Rahul discuss poll drubbingBreaking its silence a day after results of the Bihar assembly polls were declared, the RJD on Saturday accepted the people's mandate, saying that it would continue to fight for the poor.\nMeanwhile, the top leadership of its ally, the Congress, held a review meeting in Delhi, even as leaders of the grand old party continued to question the legitimacy of the electoral process.\nIn Patna, LJP (Ram Vilas) president and Union minister Chirag Paswan met Bihar chief minister Nitish Kumar, and congratulated him on securing another term.\nLater, speaking at a press conference, Paswan said he met Kumar to discuss government formation.\nAt 11 am on Sunday, strategist-turned-politician Prashant Kishor will hold a press conference in Patna.\nHis party Jan Suraaj drew a blank in its maiden electoral outing.\n'Government will be formed before November 22', says Chirag Paswan\n'Congress' central team analysing Bihar election defeat; truth will be revealed after that,' says Karnataka minister MB Patil\n'Nitish Kumar was X factor...\nthe vote that could have come to us consolidated to NDA ': Jan Suraaj's Pavan Varma on Bihar polls\nHailing JD(U) leader and Bihar Chief Minister Nitish Kumar as the \"X factor\" behind NDA's landslide victory in asembly polls, Jan Suraaj spokesperson Pavan Varma said people did not want the \"Jungle Raaj\" to return and hence decided to consolidate the \"existing forces\" that could stop the RJD.\nIn an exclusive interview with ANI, Kumar said, \"Nitish Ji was the X factor.\nPeople used to think Nitish ji's time was over.\nThere were many speculations about his health.\nNitish ji's greatest contribution after the Jungle raaj was to restore law and order.\nThere was no nepotism; there was his personal integrity.\nThe third thing is that people call him Shushashan Babu.\nHe was the most polished product of India's socialist movement.\"\nThe former diplomat and renowned author said people decided to \"consolidate the existing forces\" to stop the return of RJD's \"Jungle Raaj,\" which also harmed the Prashant Kishor's party.\n\"People of Bihar did not want the jungle raaj of Lalu ji, RJD and Tejashwi to return.\nSo the people decided to consolidate the existing forces that can stop RJD.\nThe vote that could have come to us consolidated to NDA,\" he said.\nFurther speaking with ANI, Pavan Kumar said that it has become \"very hard to defeat\" the ruling parties because they can \"open the treasury\" before the elections, referring to the distribution of Rs 10,000 to women under Mukhyamantri Mahila Rojgar Yojana.\nLalu Prasad Yadav's daughter, Rohini Acharya, who announced her separation from both her family and the Rashtriya Janata Dal (RJD) on Saturday, has now levelled fresh and explosive allegations against her brother and party leader Tejashwi Yadav.\nJust a day after declaring she was distancing herself, Rohini accused Tejashwi of humiliating and abusing her, claiming that matters escalated to the point where \"a slipper was raised to hit her.\"\nNitish Kumar was the CM in Bihar and he will continue to be the CM with a majority.\nJDU's Neeraj Kumar on RJD leader Rohini Acharya's decision to quit politics and disown her family\nJDU leader Neeraj Kumar said, \"Rohini Acharya is a daughter who saved her father's life, a daughter is Lakshmi, insulting her has never been part of our tradition and why are Lalu Yadav and Rabri Devi silent on this?\nThis is the second incident, it happened with Aishwarya first and now with Rohini...\nThese tears will cost Lalu Yadav very dearly, he should not become 'Dhritrashtra' of politics, and expose the one who is at fault...\nThis is their internal matter but it is a matter of concern.\"\nBihar-UP bond like Ram-Sita, 'unbreakable and strong', says Adityanath\nA day after the NDA cruised to a landslide victory in Bihar, Uttar Pradesh Chief Minister Yogi Adityanath on Saturday likened the relationship between the two states to the “unbreakable and strong” bond between Lord Ram and Sita Mata.\nAddressing a ‘Janjatiye Gaurav Diwas’ programme here, where he inaugurated and laid foundations for 432 projects worth Rs 548 crore, Adityanath said, “Uttar Pradesh and Bihar symbolise a shared culture, shared heritage, and shared resolve.\nJust like the sacred bond between Lord Ram and Janaki Mata (Sita), the relationship between the two states is unbreakable and strong.”\nBy coming out to vote in record numbers, the people of Bihar have conveyed their continued trust in the double-engine NDA government for development, good governance, and stability, he said.\nPolicies of national interest and development are receiving strong public support under Prime Minister Narendra Modi, Adityanath added.\nThe chief minister also described Sonbhadra as the energy capital of Uttar Pradesh, marking a unique confluence of natural beauty and rich resources.\nBihar rejected ‘Muslim League-Maoist Congress’, poison of casteism: PM Modi\nPrime Minister Narendra Modi on Saturday said the people of Bihar have rejected the Congress, which has become a “Muslim League-Maoist” combination, and the Opposition that spewed the “poison of casteism”.\nTaking a swipe at Rahul Gandhi, he said even the Congress’ nationalist leaders who had worked with former prime ministers Indira Gandhi and Rajiv Gandhi were sad due to the actions of the “namdar”.\nModi was speaking at a programme organised by Bihar natives living in Gujarat’s Surat city to felicitate him for the landslide victory of the National Democratic Alliance (NDA) in the assembly polls in the eastern state.\nHe said the Congress’ spate of electoral defeats in the last decade is a matter of introspection for that party.\n“The country has already rejected this ‘Muslim League-Maoist Congress’ -- MMC.\nCongress has no real existence in Bihar anymore: Jan Suraaj's Pavan Varma\nJan Suraaj spokesperson Pavan Varma said that he was \"not at all surprised\" by the Congress's performance in the election, stating that the party's ambitions were far greater than its actual electoral strength.\nHe remarked, \"The Congress party's ambitions far outweighed its electoral capabilities.\nThe Congress party fails to understand a basic truth that you cannot build a house on fantasy, the first floor, unless the foundation is laid.\"\nRecounting the rich history of India's biggest political party, Varma highlighted the sorry state of Congress's groundwork.\n\"The party's organisational groundwork has collapsed.\nCongress has no real existence in Bihar anymore,\" he said\nCommenting on Rahul Gandhi's \"Voter Adhikar Yatra,\" where he rode a motorcycle with his sister and Wayanad MP Priyanka Gandhi, along with RJD leader and Mahagathbandhan's CM face Tejashwi Yadav, Varma said such activities may grab headlines but cannot hide the party's weakness.\nBihar Election Results 2025: EC responds to Congress' '3 lakh extra voters' charge\nResponding to the Congress' Facebook post pointing to the difference between 7.42 crore voters cited in EC's Oct 6 press note announcing Bihar polls dated and the 7.45 crore electorate cited in its post-poll press statement dated Oct 11, the Election Commission on Saturday clarified that the gap was on account of the nearly 3 lakh additions made to the rolls between Oct 1, 2025 and ten days prior to the last date of nomination for both phases.\nAs per election law, an eligible person can apply for enrolment until 10 days prior to the last date of nomination for each phase relevant to the election in which he shall be voting.\n\"Hence, between October 1 and the deadline of 10 days prior to the last date of nomination for both phases, all valid applications for enrolment were scrutinised and eligible electors added so as to ensure that they were not denied their right to vote,\" said an EC official.\n\"This is why there were around 3 lakh additions in the electorate as shown in the EC press statement issued upon conclusion of Bihar poll,\" the official added.\nYou can go and ask this to Sanjay Yadav, Rameez, and Tejashwi Yadav.\nThey are the ones who threw me out of the family.\nThey don't want to take any responsibility...\nThe whole nation is asking why the party failed like this.\nWhen you name Sanjay Yadav and Rameez, you are thrown out of the house, disgraced, abused, and even hit..,\" says Rohini Acharya after leaving residence of parents Lalu Prasad Yadav and Rabri Devi.\nCongress workers meet Bihar unit president Rajesh Ram; break down over his poll loss\n'Their family matter': BJP MP Rajiv Rudy on Lalu Yadav's daughter Rohini Acharya 'disowning' her family\n\"This is their family matter.\nIt is possible that she is feeling some disappointment.\nI think that RJD is disintegrating, and the signs are not good,\" says BJP MP Rajiv Pratap Rudy.\nBihar Election Results 2025: TMC MP fumes at PM Modi’s ‘Bengal’ remark in Bihar victory speech; offers ‘reality check’\nTrinamool Congress (TMC) MP and journalist-turned-politician Sagarika Ghose on Saturday criticised Prime Minister Narendra Modi for referring to “conquering” West Bengal during his victory speech after the Bihar assembly election results.\nNarendra Modi a few reality checks.\nHe spoke as though Bengal is something to be ‘conquered’, a piece of land to be added to his CV,” Ghose told PTI.\nShe cited two reasons why, in her view, the BJP would never be able to “conquer” West Bengal.\nRead here\nBihar Election Results 2025: 'People saw there is no corruption in Bihar,' says Rajnath Singh\nExpressing happiness over the Bharatiya Janata Party (BJP)-led National Democratic Alliance's (NDA) landslide victory in the Bihar assembly polls, Defence Minister Rajnath Singh on Saturday said that the people entrusted them with power again, as there was no corruption in their government.\nSingh, who was on a visit to his parliamentary constituency, interacted with senior workers in the auditorium of the Sanskrit Vidyalaya in Sadar Cantt here.\nDeputy Chief Minister Brajesh Pathak expressed his gratitude to the defence minister while listing the work done in the cantonment assembly.\nEmphasising that the results of the Bihar assembly elections have brought about a major change in Indian politics, Rajnath said the hard work of the party workers was crucial to the victory in the polls.\nAsserting that the BJP does not do politics based on caste, creed, or religion \"like other parties\", Singh said, \"We do politics for the security, pride, culture, and development of the country.\"\n\"The people saw that there was no corruption in the Bihar government, and they once again entrusted us with power.\nThis time, the people have given the NDA a landslide majority in Bihar,\" Singh added.\nHe expressed confidence that similar results of the Bihar elections will be witnessed in Uttar Pradesh in 2027.\n(PTI)\nCongress' spate of electoral defeats in the last decade is a matter of introspection for that party Its priority is not this country, nor its people and India's future.\nA leader on bail (RJD's Tejashwi Yadav) had torn Waqf bill and said law will be reversed, but people rejected divisive politics,\" says PM Modi.\nIn Gujarat, PM Modi felicitated by people of Bihar living in Surat\nPM Narendra Modi felicitated by people hailing from Bihar living in Gujarat's Surat for massive NDA victory in eastern state.\n\"People of Bihar have power to teach politics to the rest of the world,\" says PM Modi.\n'Family should remain united': Bihar BJP chief on Lalu Yadav's daughter 'disowning' family\n\"We have heard that she (Rohini Acharya) even donated her kidney to Lalu Prasad Yadav.\nIt is unfortunate that Lalu Yadav’s family is falling apart.\nA family should stay united,\" says Bihar BJP chief Dilip Jaiswal.\nBihar Election Results 2025: 'Stamp on leadership of PM Modi, CM Nitish Kumar,' says JD(U) leader\n\"This is the people's mandate.\nPeople stamp their approval on development, thoughts, ideology, and harmony.\nThe joint venture of PM Modi's leadership and CM Nitish Kumar's leadership has strengthened villages and farmers, educational institutions,\" says JD(U) leader Arun Kumar.\nBihar Election Results 2025: 'People want someone who can serve them': Bihar deputy CM targets Rahul Gandhi\n\"Rahul Gandhi does not believe in the constitution from the beginning...\nHe cannot understand that the people of India want a 'sevak' (servant), not a 'yuvraj' (prince),\" says Bihar deputy chief minister and BJP leader Vijay Sinha.\n'It's a lesson for us': Jan Suraaj president Uday Singh\n\"It is a lesson for us that we could not instil much confidence in our voters to see us as an option.\nThe voters got scared at the end that RJD might come to power, so they shifted towards NDA.\nThe reason behind NDA's massive majority is the distribution of money by the Govt.\nThis will put pressure on Bihar's economy.\nIt is beyond my understanding how and when it will come out of this debt cycle...We are not disheartened.\nWe will keep working and fulfill the 'Bihar badlav' that we had spoken about,\" says Jan Suraaj national president Uday Singh.\nA day after facing a severe drubbing in Bihar, the Congress on Saturday questioned the role of the Election Commission in the poll process while its top leaders, including Rahul Gandhi and party chief Mallikarjun Kharge, went into a huddle to discuss the poll outcome.\nKharge and Gandhi were joined by AICC general secretary (Organisation) K C Venugopal, party treasurer Ajay Maken and AICC Bihar in-charge Krishna Allavaru, sources said.\nAccording to the sources, the leaders met to discuss the Congress' poor performance in Bihar, where the party won only six of the 61 seats it contested, its second-worst show in the state after 2010, when it won only four seats.\nGandhi did not speak to the media persons after the meeting, as the leaders of the Mahagathbandhan, of which the Congress is a part, remained in a state of disbelief after the NDA swept the polls.\n(PTI)\nBihar Election Result 2025: 'Jo jeeta wohi Sikandar' Devendra Fadnavis asks Oppn to accept defeat\nMaharashtra Chief Minister and BJP leader Devendra Fadnavis on Saturday countered the criticism targeted at the NDA after its landslide victory in Bihar, by asserting that the one who wins becomes the emperor, and asked the Opposition to accept defeat, identify mistakes and introspect.\n\"Aisa hain ki jo jeeta wohi Sikandar (the thing is that the one who wins becomes the emperor).\" \"After the defeat, one must accept the result, acknowledge the mistakes and engage in introspection.\nHowever, our Opposition does not want to do introspection,\" he told reporters on the sidelines of an event in Nagpur.\nWhen the opposition parties were in power (in Bihar earlier), even they had an opportunity to implement various public welfare schemes.\nBut they did not do so, he alleged.\n\"People liked the schemes we (NDA) undertook and they voted for us,\" he said.\nBihar Election Result 2025: Lalu Prasad Yadav's daughter Rohini Acharya 'disowns' family, quits politics\nA day after the RJD was drubbed in the Bihar assembly polls, party president Lalu Prasad’s daughter Rohini Acharya on Saturday announced that she was \"quitting politics\" and severed ties with the family.\nAcharya, a doctor by qualification, who chose to become a homemaker and settled with her Singapore-based husband, made the announcement in a cryptic post on her X handle.\n“I am quitting politics and I am disowning my family…This is what Sanjay Yadav and Rameez had asked me to do…and I am taking all the blame,\" she wrote in her post.\n(PTI)\nSanjay Yadav is the Rajya Sabha MP from RJD and one of the most trusted aides of Tejashwi Yadav, the son and heir apparent of RJD supremo Lalu Prasad.\nRameez is said to be Tejashwi’s old friend who hails from a political family in neighbouring Uttar Pradesh.\nIt was not clear from Acharya’s post what exactly Sanjay Yadav and Rameez had said to her.\nThe two were not available for comments either.\nThe LJP (Ram Vilas), an NDA constituent, secured 19 wins.\nThe Congress, a Mahagathbandhan constituent, won six constituencies, and the AIMIM five.\nNDA allies Hindustani Awam Morcha (Secular) and Rashtriya Lok Morcha won five and four seats respectively, while others win nine seats.\nVoting for the Bihar assembly polls was held and November 6 and 11, covering 121 and 122 constituencies, respectively.\nThe counting of votes was held on Friday.\nThe counting of votes is underway for the Bihar Assembly elections 2025, held in two phases on November 6 and November 11.\nTrends show that the ruling National Democratic Alliance (NDA)— comprising the Bharatiya Janata Party and Janata Dal (United)— is likely to form the government again in the State.\nAlso Read: Bihar election 2025 results LIVE updates\nThe Mahagathbandhan, which includes the Indian National Congress and the Rashtriya Janata Dal, is a distant second, while Prashant Kishor’s Jan Suraaj Party is yet to make its mark.\nWhile final outcomes for seats are finalised in the evening, trends have emerged pointing to likely winners in a number of pivotal seats.\nWe take a look at these key battles and candidates.\nRJD’s acting chief Tejashwi Yadav and BJP’s Satish Kumar Yadav are in a closely fought battle in RJD home turf and stronghold Raghopur.\nAfter 9 rounds of counting (of 30), Satish Kumar Yadav is maintaining a slim margin of just over 2200 votes.\nTejashwi is seeking a third term from the seat, which was previously held by both his parents Lalu Prasad and Rabri Devi.\nHis chief opponent Satish Kumar Yadav emerged as a giant slayer in 2010 when he defeated Rabri Devi by a margin of 13,006 votes.\nSince then, he has consistently lost to Mr.\nOthers in field include JSP’s Chanchal Singh and Prem Kumar of the Janshakti Janata Dal (JJD), a party floated by Tejashwi’s brother Tej Pratap.\nWith its sizable Yadav population, RJD has held on to this seat since 1998 (except 2010-2015).\nIn her poll debut, 25-year-old Bihari folk singer Maithili Thakur, who joined the BJP in October, is leading against RJD heavyweight Binod Mishra in Alinagar by a margin of around 8500 votes.\nThakur has promised to rename Alinagar as Sitanagar, paying homage to Goddess Sita whose birthplace is said to be in the Mithila region.\nJSP’s Biplaw Kumar Chowdhary and AAP’s Rajipal Jha are also in the fray.\nFalling under the Darbhanga area, Alinagar has a sizable Muslim population and has been held by the Mahagathbandhan since 2008 with RJD’s Abdul Bari Siddiqui winning it twice (2010 and 2015) and VIP’s Mishri Lal Yadav winning it in 2020.\nYadav – who had jumped ship to the NDA in 2022, resigned from BJP.\nKanti, which saw an impressive 71.92% turnout, is witnessing a close contest between former JD(U) State cabinet minister Ajit Kumar and incumbent RJD MLA Mohammed Israil Mansuri.\nKumar is leading by more than 11,000 votes, whole Mr.\nThe Jan Suraaj Party’s Sudarshan Mishra is a distant third.\nSultanganj is witnessing a battle between JD(U) and RJD.\nJD(U)’s Lalit Narayan Mandal is leading by around 8000 votes while RJD’s Chandan Kumar Sinha is trailing.\nMunger, a swing constituency and part of the Bihar industrial belt, is witnessing a battle between BJP’s Kumar Pranay and RJD’s Avinash Kumar Vidyarthi.\nAs of writing, Kumar Pranay is leading by almost 7000 votes, while Mr.\nAn independent, Santosh Kumar Mandal, is third while Sanjay Kumar Singh of the Jan Suraaj Party is trailing in fourth place.\nKatihar was expected to witness a close contest with multiple parties fielding candidates.\nIn the field are former deputy Chief Minister Tarkishore Prasad (BJP), Saurav Kumar Agarwal of the Vikassheel Insaan Party, independent Dr.\nRam Prakash Mahto, Manisha Kumari of the Peoples Party of India (Democratic), Dr.\nGhazi Sharique of the Jan Suraaj Party, Ahmad Raza of All India Majlis E-Inquilab-E Millat (AIMIM) and Rajesh Gurnani of Aam Aadmi Party.\nBJP’s Tarkishore Prasad, who has also held multiple portfolios in previous governments, is currently leading with a little more than 3000 votes.\nRJD bastion Mahua was considered a contest between Lalu Yadav’s estranged son Tej Pratap Yadav of the JJD and incumbent MLA Mukesh Kumar Raushan of the RJD.\nHowever, Sanjay Kumar Singh of the Lok Janshakti Party (Ram Vilas), the candidate fielded by the NDA, is pulling ahead of both candidates, with around 17,000 more than Mr.\nIn third place is Tej Pratap Yadav, who was expelled from ‘party and family for irresponsible behaviour’ and launched his own outfit JJD in October.\nBJP’s Mangal Pandey, who was health minister in the outgoing State government, is leading over incumbent RJD MLA Awadh Bihari Choudhary by a margin of more than 11,000 votes in the Muslim-majority Siwan constituency.\nOthers in the field include AIMIM’s Kafi Samshir and JSP’s Intekhab Ahmad.\nThis marks the poll debut for Mr.\nPandey, who has been an MLC since 2012, while RJD veteran and former Assembly speaker Mr.\nChoudhary has won this seat six times (1985, 1990, 1995, 2000, 2005 and 2020).\nJD(U)’s Anant Kumar Singh is leading against RJD’s Veena Devi by more than 22,000 votes.\nThe Mokama battle gained notoriety in the past few weeks after gangster-turned-politician Anant Kumar Singh was arrested for the murder of JSP supporter Dular Chand Yadav.\nHe was also convicted for the possession of weapons in 2022, resulting in his disqualification as MLA, after holding the seat since 2005 as an RJD member.\nSingh switched to the JD(U) in 2024.\nSingh’s chief opponent Veena Devi is the wife of gangster Suraj Bhan Singh.\nAlso in the field is JSP’s Priyadarshi Piyush.\nBettiah is proving to be a key NDA vs Mahagathbandhan battleground, with incumbent MLA Renu Devi (BJP) leading by only around 2000 votes against the Congress’ Washi Ahmad.\nIn third place is independent candidate Rohit Kumar Sikaria while Anil Kumar Singh of the Jan Suraaj Party has been relegated to a distant fourth.\nIn Jamui, incumbent MLA and champion shooter Shreyasi Singh (BJP) is up against RJD’s Mohammed Shamshad Alam.\nThe Commonwealth medalist is leading by a sizeable margin of around 26000 votes.\nAlam, who targeted migration and underdevelopment as key issues.\nAnil Prasad Sah (Jan Suraaj Party) is third.\nJamui, a swing constituency in a rural belt impacted by Naxalite activity, is considered a litmus test for BJP to hold its own against the Mahagathbandhan’s messaging around socio-economic issues.\nThe constituency witnessed a high turnout during the elections.\nIn the urban centre of Muzaffarpur, considered a BJP stronghold, the party’s candidate Ranjan Kumar is leading over Congress’ Bijendra Chaudhary with a margin of around 15,000 votes.\nA.K Das of the Jan Suraaj Party.\nMotihari, considered a testing ground for Prashant Kishor’s Jan Suraaj Party, has seen the JSP candidate Atul Kumar relegated to the sidelines of a BJP vs RJD battle.\nBJP’s Pramod Kumar is pulling ahead by more than 6000 votes, while RJD’s Dewa Gupta is in second place.\nIn swing constituency Sitamarhi, BJP’s Sunil Kumar Pintu is leading against RJD’s Sunil Kumar Kushwaha by more than 11,000 votes.\nPintu, an ex-MLA who has won the seat thrice, was defeated by Mr.\nSitamarhi’s incumbent MLA Mithilesh Kumar, who has often switched between BJP and RJD, was dropped by the BJP.\nRJD’s Rahul Kumar is leading against JD(U)’s Chandreshwar Prasad by a slim margin of around 2400 votes in Jehanabad, an area dominated by Muslims and the Yadav community.\nIn third place is JSP’s Abhiram Singh.\nPramod Yadav was fielded for this seat by the Pashupati Nath Paras’ Rashtriya Lok Janashakti Party, which had exited the Mahagathbandhan.\nJehanabad is regarded as a stronghold for the RJD, which has held the seat since 1995, except for the period between 2010 and 2015.\nAlso in the field is JSP’s Md.\nThis is a rematch of the 2024 by-elections, which took place after eight-time MLA Surendra Prasad Yadav was elected to the Lok Sabha from Jehanabad.\nVishwanath was defeated by Ms.\nManorama – wife of late gangster Bindeshwari Prasad Yadav.\nFalling under Aurangabad region, the Kutumba seat (reserved for Scheduled Castes) is witnessing a fight between the Congress and Hindustani Awam Morcha (Secular), smaller members of their respective coalitions.\nEx-JDU MLA Lalan Ram, who is now with Jitan Ram Manjhi’s HAMS, is leading by a margin of more than 9000 votes against incumbent Congress MLA and Congress State chief Rajesh Kumar.\nAlso in the field is Ram Janam Ram, fielded by Chandrashekhar Azad’s Aazad Samaj Party (Kanshi Ram).\nKumar had been regarded as a potential Deputy CM pick in a Mahagathbandhan government.\nRam had previously lost to Mr.\nKumar in the 2020 polls after running as an independent.\nJiten Ram Manjhi’s daughter-in-law Deepa Kumari of the Hindustan Awam Morcha (Secular) is leading against architect Ritu Priya Chaudhary of the RJD by a margin of more than 16,000 votes in Imamganj, viewed as Mr.\nAn NDA stronghold, Imamganj has remained with the JDU and later HAMS since 1990 when Uday Narayan Chaudhary first wrested it from Congress’ Srichand Singh.\nMs Manjhi’s poll fight was close in the bypolls in November last year after JSP’s Jitendra Paswan polled 20% of the votes, handing Ms.\nManjhi a victory by less than 6000 votes.\nJD(U)’s Shagufta Azim is leading by a slim margin of around 2600 votes against incumbent Congress MLA Abidur Rahman, who is seeking his third term.\nJSP has fielded Farhat Ara Begum while AIMIM fielded Md.\nManzoor Alam in Muslim majority Araria, which is located in the poverty and flood-stricken Seemanchal region.\nQamrul Hoda of the Congress is pulling ahead by a margin of 20,000 votes against AIMIM’s Shams Aghaz.\nAlso in the field are BJP’s Sweety Singh and JSP’s Md.\nAnother Seemanchal seat, Kishanganj is a Mahagathbandhan stronghold which the BJP has never won.\nA Muslim-dominated constituency, Kishanganj has always had a Muslim MLA with Congress’ Ijaharul Hussain winning it in 2020.\nBJP’s Vijay Kumar Khemka, the incumbent MLA seeking his third term, is leading by a margin of around 33,000 votes over Congress’ Jitendra Kumar.\nAlso in the fray is JSP’s Santosh Kumar Singh.\nPurnia is a communist-turned-NDA stronghold that has bucked the trend in the general Seemanchal region.\nThe NDA has promised the construction of an international in Purnia in a bid to retain the seat for an eighth time.\nBJP’s Ratnesh Kumar Kushwaha is leading against Congress’ Shashant Shekhar by a margin of around 23,000 votes.\nIn third place is Jan Suraaj Party’s Vinita Mishra.\nA key urban constituency in the state capital, Patna Sahib has long been a BJP bastion.\nWith a large base of professionals, youth, and middle-class voters, the seat is expected to gauge the urban appeal of the BJP and shifting political moods in the capital.\nTrends in other constituencies in the Patna region are as follows:\nArun Kumar of the Lok Janshakti Party (Ram Vilas) leading against RJD’s Aniruddh Kumar.\nBJP’s Nitin Nabin leading against RJD’s Rekha Kumari.\nJSP’s Vandana Kumari is third.\nAam Aadmi Party has also fielded a candidate- Pankaj Kumar.\nBJP’s Sanjiv Chaurasia is leading, while in second place is Divya Gautam of the Communist Party of India (Marxist-Leninist) (Liberation).\nThe Jan Suraaj Party has fielded Ritesh Ranjan ‘Bittu’ Singh.\nBJPs’ Sanjay Kumar is leading over Congress’ Indradeep Kumar Chandravanshi.\nJSP fielded Krishna Chandra Sinha.\nRupa Kumari (Lok Janshakti Party Ram Vilas) is leading over RJD’s Dr.\nIn third place is JSP’s Raju Kumar.\nPublished - November 14, 2025 03:06 pm IST\nBased on Bihar election results’ trends released by the Election Commission of India, which are now available for 240 of the 243 seats, a distinct pattern is emerging.\nThe vote share patterns are in line with what was registered during the 2024 Lok Sabha elections.\nThe NDA’s overall voteshare, after including all its alliance partners, is now 48.3%.\nThe trends are based on results available until 11.15 a.m.\nAlso read: Bihar election 2025 results LIVE\nThis performance mirrors what the coalition managed in the 2024 Lok Sabha elections, where the BJP got a 21% vote share (up by 1.4 points in 2025), JD(U) - 18.9% (reduced marginally by 0.4 points), and the LJPRV with 6.6% (that came down marginally by 0.9 points).\nIn 2024, the NDA’s vote share was nearly identical: 48.2%.\nThe table shows the party-wise vote share secured in the 2020 Bihar Assembly Elections, 2024 Lok Sabha elections and 2025 Bihar Assembly elections.\nEven though the RJD has managed leads only in 36 seats so far, its vote share (23%) in the 2025 Bihar Assembly Elections went up slightly from the 22.6% it received in the 2024 Lok Sabha elections, while the Congress’s vote share dropped from 9.4% in 2024 to 7.9% in the current elections.\nThe Mahagathbandhan’s vote share in 2025 is 36.9%, nearly 3 percentage points down from the 40.1% received in the 2024 Lok Sabha elections.\nThe Congress and smaller parties such as the Vikassheel Insaan Party suffered relatively higher drops in vote shares.\nThe Jan Suraaj Party has managed a 3.5% vote share, largely at the expense of the Mahagathbandhan while the All India Majlis-e-Ittehadul Muslimeen has increased its vote share to 1.4% from 0.9% in the Lok Sabha elections.\nIn sum, the anti-incumbency vote was split a bit by the JSP and the AIMIM, while the NDA’s voteshare was intact, helping it to romp through in the 2025 elections.\nThe story will be updated with the final tally when all votes get counted.\nThe figures are based on initial trends.\nPublished - November 14, 2025 12:00 pm IST\nThis is a Premium article available exclusively to our subscribers.\nTo read 250+ such premium articles every\nArticles older than 1 year are a part of The\nHindu archives,available only to our premium\nYou have exhausted your free article limit.\nPlease support quality journalism.\nYou have exhausted your free article limit.\nThis is your last free article.\nThe National Democratic Alliance’s (NDA) sweeping victory in the Bihar Assembly elections, securing over 200 of the 243 seats, represents more than just electoral dominance: it exemplifies how India’s first-past-the-post system can magnify vote share advantages when party systems consolidate around two principal alliances.\nThe arithmetic tells a compelling story.\nThe NDA secured 47.2% of the vote while the Mahagathbandhan (MGB) obtained 37.3%, a gap of nearly 10 percentage points.\nWhile significant, this margin alone doesn’t fully explain the NDA’s bumper harvest of seats.\nThe answer lies in the structural transformation of Bihar’s party system over the past decade.\nThe MGB’s performance reveals a curious stagnation.\nDespite incorporating smaller parties such as the Vikassheel Insaan Party (VIP), targeting the Mallah community, and the Indian Inclusive Party, aimed at the Tanti-Paan community (listed among the Extremely Backward Classes), the alliance could not improve upon its 2020 vote share of 37.23%.\nThe promised arithmetic of caste-based mobilisation failed to translate into additional votes.\nIn contrast, the NDA registered a remarkable surge, increasing its vote share by nearly 10 percentage points.\nThis was largely driven by the return of the Lok Janshakti Party (Ram Vilas) to the NDA fold, which alone contributed 5.5% of the votes.\nAdditionally, the Bharatiya Janata Party and Janata Dal (United) each expanded their vote shares by 1.5 and 3 percentage points respectively.\nThe JD(U)’s gains merit particular attention.\nThe party benefited from two reinforcing factors: transferable votes from LJP (RV) supporters, which in 2020 had fielded candidates exclusively against JD(U) nominees under Chirag Paswan’s leadership, and a surge in women voters, many of whom favoured the party, likely influenced by its welfare schemes targeted at women.\nBihar’s political landscape has historically been characterised by fragmentation, with multiple parties competing vigorously across constituencies.\nAn examination of the average Effective Number of Parties (ENOP) across Assembly and Lok Sabha elections through 2015 reveals consistently high fragmentation, with ENOP values exceeding 3.\nThis meant that vote shares translated inefficiently into seat shares, as votes were dispersed across multiple contestants.\nThe below chart shows the average effective number of parties in each election (Assembly or Lok Sabha) since 2005 (after Bihar’s bifurcation)\nThe effective number of parties is an index that measures the number of significant political parties in a constituency by weighting them by their relative strength.\nThis calculation, developed by Laakso and Taagepera, provides a more accurate picture of the political landscape than simply counting all parties.\nThe resulting number helps in assessing the degree of political fragmentation in each seat.\nFor instance, an index value of 2 suggests a bipolar contest, 3 indicates a triangular competition, and 4 or more points to a fragmented system.\nConversely, a value of 1 implies that only one party competed effectively.\nA decisive shift began with the 2019 Lok Sabha elections, when the consolidation of Bihar’s political forces into two principal alliances, the NDA and the MGB, dramatically reduced fragmentation.\nThe ENOP dropped to 2.58, signalling the emergence of a bipolar contest.\nThe 2020 Assembly elections appeared to reverse this trend, with ENOP rising to 3.34, but this was an aberration caused by LJP’s decision to contest separately against JD(U) candidates.\nThe 2024 Lok Sabha elections demonstrated the electoral potency of consolidated alliances.\nWith LJP (RV) back in the NDA fold and facing the same alliance structure that would persist into 2025, the ENOP fell to 2.41.\nThe NDA reaped the benefits of this consolidation, dominating in Assembly segments across the state.\nThe 2025 Assembly elections maintained this bipolar structure, though with a slight increase in fragmentation (ENOP of 2.65) due to the entry of Prashant Kishor’s Jan Suraaj Party (JSP).\nHowever, rather than challenge the NDA, JSP appears to have drawn votes primarily from the anti-incumbency pool.\nThe JSP’s performance proved decisive in shaping the final outcome.\nSecuring 3.5% of the vote, the party—along with the All India Majlis-e-Ittehadul Muslimeen—split the anti-incumbency vote.\nThe MGB’s vote share declined from the 40.1% it registered in the 2024 Lok Sabha elections to 37.3% in 2025, a drop of 2.8 percentage points, closely mirroring the JSP’s vote share.\nIn a fragmented party system, such vote splits might have limited consequences.\nBut in a bipolar contest operating under first-past-the-post rules, even small vote share differences translate into disproportionate seat gains for the leading alliance.\nAgain, India’s electoral system rewards concentrated vote shares in bipolar contests.\nWhen the party system features only two major alternatives, the leading alliance doesn’t merely win more seats: it often sweeps constituencies.\nThe NDA’s 10-percentage-point advantage, operating in a political environment where the ENOP has fallen below 3, created the conditions for its landslide.\nThis is the fundamental arithmetic that delivered the NDA’s triumph: a combination of alliance consolidation, which concentrated anti-establishment votes within the MGB, and the strategic fragmentation of that opposition vote by the JSP and AIMIM, which prevented the MGB from capitalising fully on anti-incumbency sentiment.\nThe NDA has built a more diverse coalition based on caste identities: The BJP has consolidated its support among the upper castes.\nThe JD(U) stitched together support from the EBCs, non-Yadav OBCs, and “Mahadalits” besides targeting women as a category.\nThe LJP(RV) catered to the Pasi and other Dalit communities, while smaller parties attracted votes from the Dalit and Koeri communities.\nThe MGB’s counter mobilisation — the RJD’s Yadav-Muslim base, and the Congress’ and the Left’s eclectic support — was not numerically enough to overcome this."
    }
  ]
}